{"101-Training-Program/advanced-movement-mechanics":{"title":"Advanced Movement Mech.","links":[],"tags":[],"content":"\nMovement Speeds\nDepending on the situation, the team might be required to move at different speeds in order to move effectively as a unit. It could be used to slow down to let others catch up while still maintaining movement at all times to avoid being vulnerable, or to speed up to catch up with others or to approach an objective much faster.\nSingle Time:\nWalking Pace by only holding the “W” key to initiate slow movement. Great to be used when you want to rally with another squad or team, however, you want to slow down to give them time to catch up to your pace or position. Can still serve other purposes but would generally be used this way.\nDouble Time:\nNormal Sprinting Pace by holding the “W” key and the “Sprint” key. This will normally be used to get from A to B and will be consistent with the rest of the squad. All classes will be double time.\nTriple Time:\nFast Running Pace by utilizing equipment available or utility. This is used to get to an objective as fast as possible and with as little downtime, usually used to capture an objective or to board a Pelican.\n\nGeneral Movement\nSituational Awareness:\nSituational Awareness is simply about knowing what is going on around you and how you can use that knowledge to survive. This training will go more in-depth about types of things to be aware of, however, it is good to have a general idea of what it means.\nIf you want to succeed in this unit and become a better rifleman, you need to know this. It is not because of your aim or your unluckiness, it is about knowing how to survive by being cautious and knowing the hazards around you. This skill can be taught but only through practice and continuous use of it. Knowing maps is part of situational awareness and can only help you succeed.\nMoving to Cover:\nAlthough it sounds like a very obvious topic to cover, it is not utilized enough. Every moment you are not in cover, you are vulnerable, no matter how secure you think you are. If you are capturing your objective, for example, you can very easily get sniped on the point across the map if you are standing still exposed. You must always be aware of the path you take and utilize the most cover possible to move to it and reduce your own exposure as well as your team. Although there will not always be cover available in an open field, it is your job to find as much defilade or any natural land cover to position yourself in or to move into cover as soon as you cross the open field.\nSpacing\nSpacing is putting distance between you and your team in order to spread out and reduce area of effect damage. The two types of spacing commonly used are: Formal and Combat Spacing.\nFormal Spacing:\nFormal Spacing is lining up either shoulder to shoulder or back-to-back spacing, which is used to line up or stay in formations before moving into a combat zone. This is usually used to organize members into the right squad or unit.\nCombat Spacing:\nAround 5-10 meters apart will be considered combat spacing. This is used to reduce the amount of damage something does to the squad overall. A hostile grenade will be more deadly if everyone stands together in a tight-knit formation rather than if everyone is spread out and it only hits one person.\nThis is especially effective against spewers. They can, for example, attack multiple enemies at once with their spit attack. Spreading out, shooting them from different angles, and dodging abilities will help eliminate the target. It gives you more time to do damage and less time for the Spewer to damage you.\n\nCompass and Mini-Map Management\nBeing able to understand how the Compass and Mini-Map work will help you in every scenario. The Compass will help in your situational awareness as it will tell you the positioning of the environment, objectives, allies, and enemies.\nIf you want to improve your calls, use your Compass to tell directions like Northeast, Southwest, etc.\nSquad Movement:\nNot only that, but you must ensure that you are not in large clumps on the map as indicated on the Mini-Map. You want to make sure that your teammates are not in your inner circle because it is not combat spacing, which means you leave yourself and your teammate vulnerable. If your teammate does not pay attention to their spacing, do your part and move away from them.\nLone Wolfing\nLone Wolfing is defined as someone who prepares and commits to an action alone, outside of any command structure and without material assistance from any group. If your course is moving you away from your teammates and you do not see anything on your mini-map, it means you are lone wolfing. You want to avoid this habit at all costs because you are putting your team at risk by doing so. Unless it was an organized play that you planned with your team, lone wolfing is considered detrimental to your team and something you should not do. As the mentality check states, the mission and people first, always go with your team unless given permission to split off.\n"},"101-Training-Program/basic-training-introduction":{"title":"Basic Training Introduction","links":["101-Training-Program/cadet-fundamentals"],"tags":[],"content":"\n\nFor use by all members of the 101st “Hell” Battalion. Completion of this program ensures a new cadet gains membership. Inspired by the 51st “Inferno” Battalion.\n\nWelcome to the 101st Basic Cadet Training (BCT) Program, where we mold mere mortals into the fearless defenders of liberty and democracy. Get ready to embrace the irony of sweating profusely while reciting the Pledge of Allegiance.\nIn our illustrious BCT Program, cadets will have the distinct honor of mastering the art of democracy by following orders without question. Because what’s more democratic than being told exactly what to do, when to do it, and how to do it?\nPrepare yourselves, cadets, for a journey filled with more regulations than the entire Bill of Rights. Because in our program, freedom means knowing the difference between a left face and a right face, and liberty is found at the bottom of a canteen during a hydration break.\nForget about the pursuit of happiness; in our program, we pursue physical exhaustion and mental anguish with unmatched fervor. Because nothing screams “liberty” like blistered feet and sleepless nights, am I right?\nSo congratulations, cadets, on embarking on this epic journey of self-discovery and profound suffering. Remember, as you slog through the trenches of BCT, you’re not just becoming soldiers – you’re becoming the living embodiment of sarcasm, patriotism, and the Super Earth way.\nThe Basic Training is divided into 5 Sections and can be read in any order, although reading\nCadet Fundamentals\nfirst is recommended as it explains some common terminology.\n"},"101-Training-Program/cadet-fundamentals":{"title":"Cadets Fundamentals","links":["101-Training-Program/code-of-conduct","101-Training-Program/deployment-concept-overview"],"tags":[],"content":"\nWelcome to the 101st!\nWelcome to our Helldivers 2 MilSim Community, where the pursuit of fun and lore intertwines with the spread of democracy like fireworks on Freedom Day! Here, we’re not just gamers; we’re freedom fighters in digital camouflage, battling tyranny one virtual battlefield at a time. By joining our unit, you have become a cherished member of our liberty-loving brotherhood. From the depths of the Pacific to the peaks of the Himalayas, we spread the gospel of democracy to all corners of the gaming world. Our missions are as varied as the stars on Old Glory, from weekly deployments that’ll have you feeling like a modern-day minuteman to covert recon ops that’ll make you a virtual Paul Revere. But beware, comrades, for in the 101st Hell Battalion, activity and dedication are the holy grail of patriotism. Show us your unwavering commitment, and you’ll ascend the ranks faster than a bald eagle soaring through the amber waves of grain! So strap on your boots, grab your controller, and prepare to unleash the sweet symphony of freedom upon the digital landscape. For in our pixelated paradise, nothing matters more than spreading democracy, one respawn at a time!\nAs proud members of the 101st “Hell” Battalion, your mission is clear: prioritize team unity and unwavering dedication to the cause of democracy above all else. When the battlefield beckons, cast aside personal ambitions and embrace the collective spirit of camaraderie. Follow orders with the fervor of true patriots, for in the crucible of deployment, it’s not about individual glory but about standing as one against the forces of tyranny. So lock and load, soldiers, and march forward with the resolve of champions, for in our battalion, victory is not just a possibility; it’s our destiny!\nNo matter if you’re a shiny private or a decorated captain in our glorious 101st “Hell” Battalion, one thing remains steadfast: you must follow our rules with the reverence of a pilgrim at the Liberty Bell and treat your comrades with the respect befitting heroes of democracy, regardless of their stripes or stars. Whether you’re a rookie fresh from boot camp or a seasoned veteran with more medals than a Fourth of July parade, in our battalion, every patriot is equal in the eyes of High Command!\nTransclude of code-of-conduct\nNext Deployment Concept Overview\n"},"101-Training-Program/code-of-conduct":{"title":"Code of Conduct","links":[],"tags":[],"content":"\n\nUphold and salute your Commanding Officers with unwavering respect and obedience, for they are the mighty beacons guiding our glorious crusade. Follow the chain of command diligently, as a true patriot would.\n\n\nStay as active as a hyper-charged Patriot Armor! If you’re to embark on a covert mission away from the battlefield for an extended period, report your absence promptly. Remember, inactivity is akin to surrendering to the enemy and will result in assignment to the dreaded Freedom Camp.\n\n\nLet freedom reign, but keep it PG-13! No hint of nudity, lewdness, or anything that might make General Brash blush. We’re all about spreading democracy, not indecency. And remember, even your profile picture should be as pure as the stars and stripes.\n\n\nNo spamming like a malfunctioning Democracy Distributor! Use communication channels wisely and refrain from public disputes. If you’ve got a bone to pick, take it to the DMs, soldier.\n\n\nOur battlefield is a bastion of respect and camaraderie, not a breeding ground for toxicity or hate speech. Any behavior unbecoming of a true patriot, from targeted harassment to spreading dissent, will be met with the full force of justice.\n\n\nImpersonation is the highest form of treason! Don’t even think about masquerading as another patriot, whether through words or profile pictures. Individuality is our greatest strength.\n\n\nNo hawking or haggling on our hallowed grounds! This is not a marketplace; it’s a sanctuary for liberty. Cheating, hacking, or any other underhanded tactics will be met with swift justice.\n\n\nMutiny and dissent are the enemies of democracy! Any talk of revolt or undermining our Commanding Officers will be met with the most severe penalties, from demotion to expulsion from our ranks.\n\n\nTime is precious, like the last charge of a Liberty Launcher. Don’t waste the valuable time of our staff with frivolous inquiries. Consult our documents and basic info before raising a flag of concern.\n\n\nLoyalty is our currency! Patriots of the 101st shall not double-dip in other milsims or clans. Our allegiance lies solely with the cause of spreading democracy. Starsims and other games are exempt, for freedom knows no bounds.\n\n\nPoaching is akin to betraying the very essence of democracy! Any attempt to lure away our fellow patriots will result in swift and decisive action, including expulsion from our ranks.\n\n\nAlt accounts are as welcome as a communist in a fireworks factory! One patriot, one account. Let your actions be as transparent as the ideals we uphold.\n\n"},"101-Training-Program/communication-fundamentals":{"title":"Communications Fundamentals","links":["Resources/acronyms-abbreviations-slang","101-Training-Program/advanced-movement-mechanics"],"tags":[],"content":"\n\nSituation Reports\nWhen someone requests a Situation Report or Sit-Rep, they want to know how the situation is going or being handled. Even if you have not reached a certain objective yet, your superiors still want a clear image about what your plan is to move to an objective.\nSit-Rep Example:\nDeployment Leader: “I need your squad to move over to the left flank of Echo and approach the point from the rear.”\nFireteam Leader: “Seen, moving now.”\nDeployment Leader: “Give me a sit-rep.”\nFireteam Leader: “We are approaching the objective now, however, are facing a lot of bugs on our left flank. Will be able to move to the rear position in a few minutes.”\n(The Deployment Leader is the host of the operation, while the Fireteam Leader is in command of a part of the squad while it’s split up. More Acronyms to be used in the server can be found in acronyms-abbreviations-slang)\n\n3D’s of Callouts\nIt is vital that if you want information conveyed clearly and thoroughly, you need to have an understanding of the 3D’s of callouts or some variation of the 3. Every callout must follow this format, however, orders may have different SoPs when speaking. DO NOT repeat yourself unless you feel like you weren’t heard or it is a matter of urgency. You do not want to clutter the comms.\nThe 3D’s are:\nDistance: How far a specific target is from a location. This is to better determine how close or far a target is from someone and allows for people to know where to compensate in terms of weapon or equipment. It is not always necessary, however, if you believe Direction is only needed for a callout.\nDirection: The specific location of a target. Use specific landmarks or objectives to make it easier to identify the location of an enemy. Calling out the target is not good enough as that information is not helpful without knowing where the target is. It is your job to make sure that gets conveyed when you see the target. Objective Markers or Key Areas on the Map will help you. Make sure your direction is specific enough to understand.\nDescription: The description of the target itself or the subject you are trying to point out. You cannot make a callout with a direction nor without a description. An ACE report can be provided regarding the target’s health: Full Health, Half Health, Low Health.\n\nCallout Examples:\nThere is a Factory Strider on Extraction, far away!\nMultiple Devastator contacts on my ping.\nBile Titan 2 rockets to the face southwest under F3!\nObjective is all clear, no major threats, only a few Hunters north of the zone.\nTank down, southeast from us.\n\nDo Not:\n“TANK! TANK! TANK!!!”\nThe callout is being repeated and only a Description is being used. It is neither clear nor simple where the target is. Only repeat if it is of immediate urgency or the callout was not heard.\n“Ughhhh, Shrieker here”\nUnnecessary remarks in the callout as well as not specific enough direction of the target. The callout is not very important either because the target is not a priority.\n“Got Spewer” OR “Dead”\nNeither callout is specific enough, and the second does not provide a description, distance, or direction. Where was the Spewer killed? Is the point clear now? Who is dead?\n\nPriority Targets:\nOn the field, not everything has to be a callout. When you want to only provide vital and precise information, it is important to know priority targets to call out in order to be the most useful in a deployment.\nLandmarks:\nLandmarks are an important location because if they are not on a certain objective, it will be harder to track a certain target. You may utilize command landmarks on maps that are universally understood to better specify your callouts.\n\nRadio Discipline:\nRadio Discipline is utilized to decrease the amount of excessive and pointless chatter on the comms side of a deployment. When there are 4 people in a deployment and everyone is talking pointlessly, there will be a lot of radio traffic on the comms, especially when someone is trying to give orders. When not talking about callouts or planning attacks, the person should be quiet to maintain clear communication.\nAs a troop unit on the field, not all callouts will apply to you due to distance or vicinity. It is your job to be able to distinguish what callout or orders are important to you, which ones to follow, and which ones to ignore. They will not always call you out by name or unit, so it is important you understand how it works.\n\nOrder Acknowledgment:\nIf you are receiving an order, make sure to comply with your superior to notify them that you comply with the order:\nSeen/Copy – say one of these to show you understand what is being said.\n\nClear Comms:\n“Clear Comms” is something you say when there is traffic in the comms, and you need to relay a message of urgency. It can be repeated 3 times. When you call out with a loud tone: “Clear Comms,” it is a signal to everyone in the voice chat to lock it up and be quiet so they can hear your transmission. This can also be used when the deployment leader requires everyone’s attention, however, too many people are talking at once. When you hear “Clear Comms,” you must be quiet even if you were in the middle of making a callout.\n\nNext advanced-movement-mechanics\n"},"101-Training-Program/deployment-concept-overview":{"title":"Deployment Concept Overview","links":["Deployment-Signups","101-Training-Program/communication-fundamentals"],"tags":[],"content":"\n\nDeployment Premise\nWhen it comes to deployments, we’re talking about the pinnacle of organized play, where the bonds of brotherhood are forged in the fires of teamwork! But beware, for in this digital battlefield, the chain of command may shift like the winds of liberty. Whether you’re following the orders of a seasoned sergeant or a fresh-faced lieutenant, one thing remains constant: obedience is the name of the game.\nAs you load into the fray alongside your comrades, the deployment leader holds the keys to victory. Prepare yourselves for the call to arms, whether it be tactical communication fit for a war room or casual banter befitting a gathering of patriots at the local watering hole. Flexibility is our greatest asset on the battlefield, after all!\nSo remember, when the deployment leader speaks, listen closely and follow their lead. For in the chaos of war, it’s the unity of purpose that will carry us to victory!\nDeployment Rules\nAs we embark on our noble quest for victory, let’s not forget the rules of engagement that govern our actions on the battlefield. Respect, discipline, and adherence to protocol are the cornerstones of our mission, so pay heed to the following directives:\n\n\nShow utmost respect to our esteemed Deployment Leader and obey their every decree. Their word is law on the battlefield!\n\n\nKeep communication clear and concise; no shouting down the mic like a banshee in battle!\n\n\nA deployment counts as successful only if and when at least 3 Missions and 45min have passed. But do not fear! Even failed Missions and Deployment goals count towards your attendance numbers and as long as we can learn from them, they make us even stronger! Just make sure to write them up in the Tallies Channel on the Discord.\n\n\nFailure to use your assigned class during deployment may result in sanctions, so stay true to your role!\n\n\nImagine yourself as a Deployment Leader, while being a soldier do not behave in a manner you wouldn’t like your soldiers to behave in. Treat others the way you want to be treated!\n\n\nLet these rules guide you as we march forward, united in purpose and steadfast in our resolve to crush tyranny beneath our collective boot!\nFollowing Leadership\nWithin our ranks, every troop is a vital cog in the machinery of freedom, bound by duty and honor to heed the commands of their superiors. It is not merely a responsibility, but a sacred obligation, to rally alongside our brothers-in-arms and march forward as one cohesive force. Together, we strive tirelessly towards a common goal, driven by the noble ideals of liberty and justice for all. Let the spirit of camaraderie and unity guide our every step, for in our unity lies the strength to overcome any obstacle and emerge victorious on the battlefield of freedom!\nDebriefings\nAfter the dust settles and victory or defeat hangs heavy in the air, the deployment leader takes charge once more, guiding the unit into a hallowed ritual known as the debriefing phase. This is not merely a procedural formality; it is a cornerstone of our collective ethos, reminiscent of the democratic ideals upon which our Super Earth was founded. As the stars and stripes wave proudly overhead, we gather as equals, from the most seasoned veterans to the freshest recruits, to engage in a profound reflection on our shared journey.\nWith precision, each member of the unit contributes their insights and observations.. Here, there is no rank nor file; only the common bond of service to a cause greater than ourselves. Troopers and cadets, emboldened by the spirit of liberty, speak freely, unafraid to voice concerns or criticisms of their superiors should they arise. For it is in this sacred space of dialogue and camaraderie that the seeds of improvement are sown, nourished by the fertile soil of mutual respect and understanding.\nThe deployment leader compiles a detailed report in the deployment-tallies channel, often including screenshots or Recordings to illuminate the end result. This report fosters transparency and accountability, guiding our unit forward with lessons learned. In these digital records, our camaraderie and spirit endure, resilient in the face of adversity.\nMore Information on how to attend Deployments: Deployment Signups\nNext communication-fundamentals\n"},"101-Training-Program/newbie-overview":{"title":"Newbie Overview","links":["101-Training-Program/basic-training-introduction","channel-overview"],"tags":[],"content":"\n\nWelcome to the Server!\nif you haven’t doe so already you should read the basic-training-introduction as it covers most of the important things to know after that you cane come back here!\nChannel Overview\nSometimes the amount of channels on this server can be a bit overwhelming so you can find an overview of most of the channels on the server in this wiki\n"},"Contributing/clarifications/aliases":{"title":"aliases","links":["Contributing/note-properties"],"tags":[],"content":"only used when dealing with note-properties changes displayed title on the wiki"},"Contributing/clarifications/notes":{"title":"notes","links":[],"tags":[],"content":"Notes are the files people can view in the wiki and aren’t used for wiki editing stuff"},"Contributing/clarifications/tags":{"title":"tags","links":["tags/medals","tags/deployments","tags/HTH"],"tags":["medals","deployments","HTH"],"content":"tags are used to link notes together without having a hyperlink in them\nExamples:\n\nmedals\ndeployments\nHTH\n"},"Contributing/custom-formatting-features":{"title":"Custom Formatting Features","links":["Contributing/custom-formatting-features"],"tags":["guide","contributing"],"content":"![[header-cff.png]]\n\nAbout\nThis page is an outline of custom formatting features implemented for use in the 101st Wiki. To use these in Obsidian, enable all CSS snippets in Obsidian’s ‘Appearance’ settings so they render correctly in Obsidian.\nFormatting\nImage Adjustments\nImage adjustments from SIRvb’s Image Adjustments CSS snippet are incorporated into the Wiki. Some examples of how it can be used include:\n\nresizing images\ndisplaying images as a banner across the page or across a callout\nimage-warp (using the CSS ‘float’ property), allowing text and other content to wrap around an image.\n\nKeyboard-Styled Text\nText can be styled like the keys of a keyboard by wrapping text within &lt;kbd&gt; &lt;/kbd&gt; HTML tags. For example, &lt;kbd&gt;ctrl&lt;/kbd&gt; + &lt;kbd&gt;alt&lt;/kbd&gt; + &lt;kbd&gt;del&lt;/kbd&gt; gets rendered as ctrl + alt + del.\nThese should be used for any instance where programs’ default hotkeys (ones which are not customizable, or are the default keybinding) are mentioned.\n\n\n                  \n                  Closing HTML tags \n                  \n                \n\n&lt;kbd&gt; is an HTML tag. It is used to surround an ‘element’ (in this case, a piece of text). As it is not self-closing, the second tag in a pair of tags needs a forward slash (/) to ‘close’ it.\nExample: &lt;kbd&gt; &lt;/kbd&gt;.\n\n\n\nCallout Adjustments\nthe Wiki borrows a large number of Callout Adjustments from SIRvb’s ‘ITS Theme’ for Obsidian. These add much-needed flexibility for styling and positioning callouts.\nSyntax:\nbasic syntax&gt; [!callout-type|adjustment adjustment2]\n&gt; \nexamples&gt; [!tip|right]\n&gt; \n \n&gt; [!warning|title-center]\n&gt; \n \n&gt; [!note|clean no-title embed]\n&gt; \nCallout Titles\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbbr.Full TitleDescriptionno-tno-titleHides callout titles-tshow-titleShow callout titlettl-ctitle-centerCenter callout title textno-ino-iconHide callout iconsubtsubtitleStyle words in italic (* *, _ _) as subtitles\nCallout Text\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbbr.Full TitleDescriptiontxt-ctext-centerCenter callout texttxt-rtxt-rightRight align callout texttxt-ltxt-leftLeft align callout texttxt-stext-smallShrink callout text size\nCallout Styling\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbbr.Full TitleDescriptionembedRemove callout padding to expand embedcleanRemove callout stylingcollapseRemove all padding and margins for ultra compact looknbrdno-borderBorderless calloutclearMove any other floating elements near to under this calloutn-thno-table-headerHides table header in callouts\nCallout Content Padding\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAttributeAbbrCallout Padding Sizingcontent-padding-smallc-p-sm6pxcontent-padding-mediumc-p-med12pxcontent-padding-largec-p-lg24px\nCallout Positioning\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAttributeDescriptionleftFloat callout to the leftrightFloat callout to the rightcenterCenter the calloutfixedMaintains a callout’s float position on mobile\nCallout Sizing\nCallouts can be resized using the keywords below (sizing is the same as SIRvb’s Image Adjustments)\nThe sizing is a percentage, relative to the callout’s parent. Using |wmed as an example:\n\nif placed directly in the page body, it would take up 60% page-width.\nif nested within another callout, it would only take up 60% of the ‘parent’ callout’s width.\n\nSizing can be made to use pixels instead of percentage by adding |static.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAttributesCallout Width %Callout Width pxwmicro10%50pxwtiny20%100pxwsmall30%200pxws-med40%300pxwm-sm50%400pxwmed60%500pxwm-tl80%600pxwtall95%700pxwfull100%wfitAutoAuto\n\nCustom Callouts\nIn addition to the default Obsidian Callouts, the 101st Wiki also adds the following custom Callouts:\nColumn Callout\nThe [!column] callout lets you display content as a grid.\nThe callout itself is invisible but its contents get displayed as a grid, with each new line of the callout represents a new grid column. It works best when nesting other callouts within it. However, if you wish to write content in columns without callout styling for the nested callouts, you can add the Callout Adjustments metadata clean no-title to them.\nBy adding the flex metadata, grid columns will stack vertically on mobile.\n\n\n                  \n                  Column\n                  \n                \n\n\n\n                  \n                  Use Nested Callouts \n                  \n                \n\n[column] is designed to have callouts nested within it.\nTo remove styling from nested callouts, add clean no-title to the metadata\n\n\n\n\n                  \n                  NOTE\n                  \n                \n\nThis callout has clean no-title metadata.\nsyntax:&gt; [!column]\n&gt;\n&gt; &gt; [!note] title\n&gt; &gt;\n&gt; &gt; content\n&gt;\n&gt; &gt; [!column] title\n&gt; &gt;\n&gt; &gt; content\n\n\n\n\n                  \n                  Caption\n                  \n                \n\n\nA caption callout nested in the grid.\n\n\n\n\nCaptions\n\n\n                  \n                  Caption\n                  \n                \n\n\n[!caption|right] callout\n\n\nA borderless callout for adding captions to images.\nUse Callout Positioning metadata to float these left or right for wiki-style article image captions\nsyntax&gt; [!caption]\n&gt; \n&gt; \n&gt; ![[image.png]]\n&gt; \n&gt; Image caption.\n \n\nInfobox\nA wiki-style infobox displayed in the top right of an article to summarize data from the article, such as requirements for a tutorial article.\n\n\n                  \n                  Infobox\n                  \n                \n\nInfobox\n\nTable\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTypeNameRowRowRowRow\n\n\nType:\n\n[!infobox]\n\nSyntax:\n&gt; [!infobox]\n&gt; \n&gt; \n&gt; ## Article Title\n&gt; \n&gt; ![[image]]\n&gt; \n&gt; ### Table Heading\n&gt; \n&gt; | Type | Name |\n&gt; | --- | --- |\n&gt; | Row | Row |\n&gt; | Row | Row |\n\n\nEmbed Adjustments\nAdjustments for Obsidian embedded files, otherwise known as ‘transclusions’\nsyntax![[Embedded Note|attribute attribute]]\n \n![[intereting-note-title|clean right]]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAttributeDescriptioncleanRemoves border to hide embed styleleftFloatrightFloats embed to the right\nHide Embed Styling\nYou can hide the borders of embedded notes and blocks by adding ‘|clean]]’ to the wikilink’s alias.\n\nThis allows the embed to appear seamlessly as a part of the page it is embedded in.\n\n\n                  \n                  Column\n                  \n                \n\n\n\n                  \n                  This is a standard transclusion: Transclude of custom-formatting-features#^4beb5b\n                  \n                \n\n\n\n                  \n                  This is a &#039;clean&#039; transclusion: Transclude of custom-formatting-features#^4beb5b\n                  \n                \n\n\n\n\n\n                  \n                  Embedding block links which float left or right \n                  \n                \n\nYou must add a left or right attribute to embeds if the embedded content itself already floats left or right.\nExample:\n\nThe infobox callout already floats right. To embed it in another page, add |right to the embed wikilink’s alias.\n\nThis prevents the embed from taking up 100% of the page-width, instead of wrapping around other content\n\n\nFloat Embed Left or Right\nEmbeds can be made to float to the left or right of a page by adding |left or |right to the embed wikilink’s alias. \nAs well as being a stylistic choice to move supplementary content outside of the main flow of the text, it is also necessary when embedding a block which contains an element with a float property already stipulated (e.g., an infobox callout).\nMISC\nCSS divider\n&lt;div class=&quot;dividernc&quot;&gt;divider&lt;/div&gt;\n\nOutput:\ndivider\n"},"Contributing/how-to-contribute":{"title":"How to Contribute","links":[],"tags":["contributing","guide"],"content":"In order to contribute to the wiki, you must have three things:\n\nA GitHub account\nThe Obsidian app\nGit\n\n*nix users, feel free to grab the above applications from your local package manager instead.\nWe assume for the sake of this document that you already all three of these. We have done what we can to minimize interaction with Git and we will walk you through necessary steps to use it. We also hope that you will very much enjoy using Obsidian.\nFork the Repository\n\nGo to the wiki repository\nClick Fork, then Create Fork:\n\n\n\nNow you have your own unique copy of the entire repository which you can change however you like and even rehost. Note that over time the repository may grow to be fairly large.\nNOTE: Developers may build the site locally with the following npm command:\nnpm i\nnpx quartz build --serve\nYou will be brought to your newly created copy of the wiki’s github. Get your repo’s url by clicking Code, then HTTPS, then the clipboard icon.\nStash the URL somewhere safe, as you will need it later. Or, if you simply want a copy of the wiki for your personal Obsidian vault - you’re done!\n\nGet A Personal Access Token\nIn order to make changes to the wiki’s GitHub through Obsidian, you must give it a special key that says it has permission from you to do so first.\n\nLog into your Github account and open your profile. Then go to Settings. You can open your profile from any part of the GitHub site by clicking your profile picture in the upper right corner of the page:\n\n\nGo to developer settings, then Personal Access Tokens, and select Token (Classic):\n\n\nOn this final menu, select Generate a Personal Access Token:\n\nOn this page you name your key and set its expiration date. We recommend doing a Custom expiration for one year from the date you are creating the key. This is as long as GitHub will allow them to live. Then, make sure to click the checkbox next to repo. Finally, click Generate Token at the bottom of the page. Please take special note of the fact that you will not be able to see your personal access token again after creating it - leave the page open until you’ve configured Obsidian!\n\n\nSet Up Obsidian\nInstall Git for Obsidian\nNow you just need to hook your personal access token and repository fork into Obsidian itself.\n\nOpen Obsidian and click the settings gear in the bottom-left.\n\nGo to Community Plugins, then Browse. Search for Git.\n\nSelect the first result, hit Install, then Enable.\n\n\nClone the Repository\n\n\nOpen the Command Palette by pressing CTRL+P\n\n\nType in clone, and select Clone an existing repo\n\n\n\nPaste in your repository URL in the following format:\nhttps://&lt;PERSONAL_ACCESS_TOKEN&gt;@github.com/&lt;USERNAME&gt;/&lt;REPO&gt;.git\nReplace &lt;PERSONAL_ACCESS_TOKEN&gt; with your previously generated key, and your username in place of &lt;USERNAME&gt;:\n\nPick a name for the folder, and leave the second box about Clone depth blank - simply press enter. Now the wiki is installed inside of obsidian, and you can make edits to your local copy of it. Let’s start by sending over this very document!\n\n\nREQUIREMENTS:\n\n\nDue to compatibility issues with Obsidian and Quartz, only some file types can be accepted. Videos must be in webm format before publication. Any audio which is not directly relevant to the subject of the video clip must be removed as well to limit file sizes. Maintainers can help you with this. You can use something like Simple Screen Recorderor OBS to record your screen with or without audio.\n\n\nSubmissions should be tagged with the tools used and subject covered. See existing guides for exmples. To add a tag, simply use an octothorpe # and the name of the tag.  feel free to make up any that are relevant.\n\n\nSend It Home\nOnce you’re done editing:\n\nMake sure the right sidebar is open\nSelect the source control view (if it’s not visible you may need to drag the sidebar a bit further out)\n\n\nYour changes will be listed here - click the back arrow to revert them, or the plus sign to Stage them. This simply means you are preparing to send them to github. Take this opportunity make sure you recognize everything you added or changed before staging your changes. Mistakes can be made!\n\nThis is where your commit message will be written. This is simply meant to be an informative note regarding the changes you made. Once that’s done, click the buttons above in the listed order. Do not click button 1 if you manually staged individual files as described above.\nYou’re all done editing! The only thing left for you the creator to do is submit it for review. Go back to your fork on GitHub. You should see a message similar to the one below; click Contribute, then Open Pull Request.\nA summary of your changes will appear. If you already know what’s been done, then keep it simple - Just press open pull request.\n\nWe promise, this is the last page. This is your opportunity to explain your changes, what they do, and why they exist. Don’t be afraid to say whatever you feel is appropriate - be elaborate, be concise, but please explain what you did somehow or another. if you wish, check Allow edits by maintainers, to allow the core team to make changes to your Pull Request whilst it’s being reviewed.\n\nReviews may be quick or not, but, please do what you are able to communicate with the team regarding any questions or issues that may come up during review. Pull Requests that are abandoned after 30 days will be assumed to be left in the entirely hands of the team and will be handled according to their judgment."},"Contributing/markdown-guide":{"title":"markdown-guide","links":[],"tags":[],"content":"source: www.markdownguide.org/cheat-sheet/\nOverview\nNearly all Markdown applications support the basic syntax outlined in the original Markdown design document. There are minor variations and discrepancies between Markdown processors — those are noted inline wherever possible.\nMarkdown Cheat Sheet\nThanks for visiting The Markdown Guide!\nThis Markdown cheat sheet provides a quick overview of all the Markdown syntax elements. It can’t cover every edge case, so if you need more information about any of these elements, refer to the reference guides for basic syntax\nSyntax\nThese are the elements outlined in John Gruber’s original design document. All Markdown applications support these elements.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nElementMarkdown SyntaxHeading# H1   ## H2   ### H3Bold**bold text**Italic*italicized text*Blockquote&gt; blockquoteOrdered List1. First item   2. Second item   3. Third item   Unordered List- First item   - Second item   - Third item   Code`code`Horizontal Rule***Link[title](www.example.com)Image![alt text](image.jpg)"},"Contributing/note-properties":{"title":"Note Properties","links":["Contributing/clarifications/notes","Contributing/clarifications/tags","Contributing/clarifications/aliases","style-guide"],"tags":["contributing","guide"],"content":"![[header-notep.png]]\n\nWhat are Note Properties?\nYou can’t see them on the website, but Properties are a central part of managing the notes in the Wiki. They allow us to add Tags, Aliases, and change the note’s Title without having to modify the filename.\n\nHow to Use Properties in Notes\nIf you are using Obsidian (highly recommended), you can open the Command Palette (default binding on Linux and Windows is ctrl+P) and type “properties.” The option Add file properties should come up.\nIf you click on this or select it with the arrow keys and press enter, this field should be added to your note:\n\nThis is essentially just this being added to the very top of your notes file:\n---\n\n---\n\nTo actually use Properties, you now have to select one of the properties (tags, title, cssclasses, etc…). Once selected, they get added to the note, and you can assign variables to that Property. For example:\n\nAdd the Property title and assign the variable TEST!. Now, what do the Properties actually do?\n\nTitle\nThe title Property changes the displayed name of the Note in the Wiki. Why use this? Well, if you’ve read the Style Guide, you’ll know:\n\nNever use spaces in Note titles.\nNever use uppercase letters in Note titles.\n\nBut we know that these rules won’t look good on the website. So, changing the displayed name of the note is crucial for making the titles more appealing!\n\nAliases\nThe aliases Property is used to make the note easier to find when a user searches the Wiki. You can add words or phrases to help a note—like “Where to find Samples”—appear in search results when someone types “Research” in the search bar.\n\nTags\nThe tags Property is similar to adding something like #deployments to a note. It functions as a way to link notes together for users who want to dive deeper into a topic. For example, every note related to medals gets the #medals tag, making them easier to find for people researching the medal system.\n"},"Contributing/quick-start-guide-obsidian":{"title":"Quick start Guide Obsidian","links":["Contributing/custom-formatting-features"],"tags":[],"content":"![[header-qsto.png]]\n\n\nWhat is Obsidian\nbesides the mineral Obsidian is a electron based Markdown editor.\nIf only half of those words made sense to you then don’t worry i will explain most of them.\nAll files in the wiki are written in markdown a open standard for creating text files like a .txt so why not just use .txt files? well markdown offers some expanded functionalety when it comes to taking notes/writing stuff for example:\nHeader 1\nHeader 2\nHeader 3\nHeaders or Bold and Italic text\nDiscord also uses a modified version of markdown for text formatting so most thing you will learn about the markdown syntax will be applicable in discord.\nWhy Obsidian\nwe use obsidian in the wiki because it has:\n\nSupport for Plugins and CSS snippets\nUses markdown\nIs compatible wit quartz (the back end of the wiki)\nIs what i used before building the Wiki\n\nWhat are CSS snippets?\nCSS is a programming language used to style elements on websites and other stuff like electron based applications like obsidian. CSS snippets are small bits of CSS code we can use to style text displayed in obsidian differently than it normally would see custom-formatting-features for examples."},"Contributing/writing-new-notes":{"title":"writing-new-notes","links":["Contributing/clarifications/notes"],"tags":[],"content":"Temporary Note\nIf you want to contribute a new note to the wiki it is important that you remember that:\n\nnote titles need to be all lowercase and without spaces use - instead\nall notes (exept notes found in the “Contributing” folder) need a header like this one\n\nyou can find a Krita file in the “01-Picture/edeting” directory\nIf you’re not a regular contributor new notes need to be discussed with Costeer\n\n"},"H.E.A.T./frequently-asked-questions-heat":{"title":"H.E.A.T. FAQ","links":["H.E.A.T./heat-resources"],"tags":[],"content":"\n\nQ: Where can I find in-depth information?\nA:  heat-resources\nQ: What happens if I fail a test?\nA: There are no permanent repercussions, but you will be required to wait one week before testing again.\nQ: What is the reward for H.E.A.T. Training?\nA: There is no reward. Training does not give rank or respect; the main goal is to show to others that you are officially competent at a class. This helps deployment hosts more accurately judge the abilities of their squad.\nQ: Is H.E.A.T. a requirement?\nA: NO. With enforcement from General Mind, H.E.A.T. is entirely separate from your ranks and honor in this battalion. Ranks are evaluated by leading, managing, and being a part of the battalion; H.E.A.T. is evaluated by skills and knowledge on the field of democracy.\nQ: Can I apply to the H.E.A.T. division?\nA: Not through training or certifications. There’s a mighty difference between being able to pass challenges and developing, testing and managing the entire system behind it.\nQ: Am I stuck to one class of H.E.A.T.?\nA: No, but there are rules about progression - if you start one class, you are not allowed to train in another until you have mastered all of T2 - the progression will be explained to you when appropriate, but please start with the class you want to main\nQ: Can I only run the loadouts I have learned?\nA: H.E.A.T. does not limit your playstyle in any way; we simply offer organized and efficient roles that are meant to mesh. If you have something that works you can use that, always\n\nTemporary Q: What if I want T2 training?\nA: As of day of launch, T2 is developed but not validated. We are prioritizing T1 training and there is no reward for being first, so be patient and learn skills in the meantime. Our division is trying to avoid burnout that has happened to many managers and hosts.\n"},"H.E.A.T./heat-index":{"title":"H.E.A.T. Index","links":["H.E.A.T./heat-resources","H.E.A.T./frequently-asked-questions-heat"],"tags":[],"content":"What is H.E.A.T. ?\nHelldivers Environmental Advanced Training is a set of skill-based playstyles and roles revolving around our five main classes. These playstyles branch into extremely specialized roles with high potential for synergistic combinations. Certification of these classes requires full completion of a set of challenges that will be proctored by a H.E.A.T. Marshall, and places your highest certification next to your callsign.\nNotes\n\nH.E.A.T. Resources\nH.E.A.T. FAQ\n\n"},"H.E.A.T./heat-resources":{"title":"H.E.A.T. Resources","links":["Resources/useful-tools"],"tags":[],"content":"\n\n\n\nChallenges for HEAT\nHEAT Certification Rules\n101st “Hell” Battalion Basic Certification Classes Guide\n\nH.E.A.T. Certification Request Template\n**Callsign:**[Ping Yourself]\n**Certification Requested: **[Tier + Class]\n\n**Availability:** [Time]\n\nReason for seeking training: [Give us some lore; bring a little RP into here]\n\n\nRemember to Ping yourself\nThe availability time should be formatted in UTC +2 or using Discord date picker\n\n"},"Internal-Affairs/ia-resources":{"title":"IA Resources","links":[],"tags":[],"content":"\n1.) Purpose and Scope:\nPurpose and Scope The Internal Affairs (IA) department ensures the integrity, discipline, and proper conduct within the 101st “Hell” Battalion. This SOP provides guidelines for addressing and investigating complaints, rule violations, and ensuring community standards are upheld. IA operates independently to maintain impartiality.\n2.) Chain of Command:\n\nInternal Affairs Commander (IAC): Leads the department, oversees all investigations, and reports to the Command Staff.\nInternal Affairs Officers: Trained Personnel who conduct investigations and handle administrative tasks related to IA matters.\nInternal Affairs Assistants: Undercover support staff who assist IA Officers in case documentation and tracking.\n\n3.) Jurisdiction and Authority\n\nIA has jurisdiction over all members of the battalion, regardless of rank or position.\nIA can initiate investigations based on complaints, observed misconduct, or routine checks.\nIA has the authority to recommend disciplinary actions, including warnings, demotions, temporary suspensions, and, in severe cases, permanent bans.\nIA operates independently from the regular military hierarchy but maintains transparency with the Command Staff.\n\n4) Investigation Protocols\n4.1) Complaint Intake\n\nComplaints can be submitted via a dedicated IA channel or through direct messages to IA officers.\nAnonymous complaints are accepted, though they may limit the depth of the investigation.\nAll complaints are logged in a confidential IA Case Management System (CMS).\n\n4.2) Case Assignment\n\nCases are assigned based on availability and the nature of the complaint. Officers should avoid conflicts of interest.\nIA Officers are expected to remain objective and unbiased throughout investigations.\n\n4.3) Initial Review\n\nIA Officers conduct an initial review to determine if the complaint is valid and within IA’s scope. Frivolous complaints are dismissed, and the complainant is informed of the decision.\nFor valid complaints, a case file is created in the IA CMS, documenting all relevant information.\n\n4.4) Fact Finding\n\nIA Officers gather evidence, including chat logs, voice channel activity, and witness testimonies. Members involved are interviewed in private.\nOfficers may request access to specific channels or data to verify claims.\nAll findings are documented with timestamps, screenshots, and written statements.\n\n4.5) Review and Recommendation\n\nOnce evidence is compiled, the IA Officer drafts a case report summarizing the findings and potential rule violations.\nThe report is reviewed by the IAC for accuracy and fairness.\nIA Officers provide disciplinary recommendations based on the severity of the violation and past infractions (if applicable).\n\n4.6) Final Decision\n\nAfter the hearing, IA reviews all evidence and makes a final decision on the disciplinary action.\nIA must document the reasoning behind all decisions for transparency and future reference.\n\n5.) Appeals\n\nMembers may appeal decisions by submitting a formal request to the Command Staff within 7 days of the ruling.\nAppeals will be handled by a HC member not previously involved in the case to ensure impartiality.\n\n6.) Confidentiality\n\nAll IA investigations are confidential. Information gathered during an investigation is shared only with IA personnel and the High Command when necessary.\nWitnesses and involved parties are informed of the expectation to maintain confidentiality to avoid disrupting the integrity of the process.\nAll communications pertaining to investigations is to be kept confidential and between the individual, Internal Affairs, and High Command. Anyone found to be discussing elements of cases outside of sanctioned channels will be censured by the Internal Affairs Commander.\n\n7.) Reporting to HC\n\nIA provides monthly reports to the High Command, detailing the number of cases handled, types of infractions, and any trends in behavior or issues that may need addressing at a higher level.\nSpecial or urgent reports can be submitted if a case has broader implications for server security or reputation.\n\nCLOSING NOTES\nThe Internal Affairs department plays a crucial role in maintaining discipline, order, and fairness within the 101st “Hell” Battalion. All IA officers are expected to carry out their duties with the utmost professionalism to ensure the server remains a safe and respectful environment for all members.\n"},"Personnel-Files/personnel-file-crumbs":{"title":"Personnel File CC-07 Crumbs","links":[],"tags":["personnel-file"],"content":"101st “Hell” Battalion\nMilitary Personnel File\n\n\n\n\n\n\n\n\n\n\n\n\n\nCodename: CPT-07 “Crumbs”Name:  ████████████Rank: CaptainDOB: ██████“You know Only thing I get when Super Earth offers me extra juice for good work? It’s always apple juice.”  -CC-07 “Crumbs”\nDuties:\nThe bold leader of the Crumbs Company, being a stalwart for the frontlines in both fronts. Leading his many platoons of battle-hardened helldivers to victory. He is the battle-ram of the “Hell” Battalion, straightforward, logistical, and intellectually gifted at wartime strategies. He is a formidable foe for any adversary. \nOperational Conduct:\nCrumbs is quite the self-sufficient person when it comes to his strategies. Using the Jump Pack as well as the Flame Thrower to employ hit and run tactics on the bugs. He uses the Orbital Rail Cannon Strike as an anti-tank option and a machine gun sentry for horde clearance and a way to use it as a decoy to make a hasty escape. \nMilitary Career:\nBefore Crumbs was enlisted, he was a inhabitant of the most infamous planet of the Umlaut Sector, Meridia. Spending his early childhood in a E-710 farm, with both of his loving parents XXXXXXX and XXXXXXX. Being exposed to the terminids early on led to his expertise with the species. His life was relatively peaceful, though Around the age of XX  his parents started to have marriage issues, and ultimately ended up with him as an orphan. Without parents Crumbs did fine, making a best friend named XXXXXXX. In the orphanage he got exposed to lots of posters about the Helldivers corps, making him resilient to trauma. Once the terminids started to escape enclosure and attack the civilians, he and several other people got evacuated to high-priority citizen bunkers, but not at a loss. As he was evacuating, his best friend got slaughtered as a bane of terminid “Warriors” lunged at him and got torn into shreds. With the blood of his friend on him he managed to make it into the bunker. As he grew up, his hatred for terminids ended up with him being enlisted to the Helldiver corps. During that time, he helped the construction of the TCS towers to repel the terminid advance. As he fell from his hellpod, he saw the familiar place he once lived, as well as the skeleton of his old friend, still wearing the Super-Earth issued uniform, just with a plethora of cuts from the warrior. A piece of fabric pinned to his armor symbolizes his best friend, and uses it as a reminder to push on. He climbed the ranks quickly, being able to lead a squad into the terminid supercolony that is meridia and launched several attacks to deploy the dark fluid into the planet. Every time, gathering trophies of the bugs, ranging from a head of a hunter, a wing of a shrieker, or even a piece of armor from a fallen bile titan. As the planet reached its limit, He witnessed the planet implode on itself, just before FTL jumping, creating the wormhole that we know today. Multiple privates have noted that he would spend long periods of time, staring into the remnants of merida, while holding a small blue piece of fabric, saying “I did it XXXXXXX, I did it for you”.\nRecruitment to the 101st “Hell” Battalion:\nShortly after his operations on Angels Venture. Crumbs kept on losing squad after squad on Malevelon Creek and eventually running out of reinforcements, Crumbs decides to go solo, changing the pace for the mission throughout.By being solo, the automaton forces had a difficult time tracking his position, him often using single-hit stratagems to make his presence less bold. By using several stealth tactics and utilizing sentries as decoys, he was able to complete many objectives for the ICBM as stealthily as possible. The only time Crumbs had to stand his ground was during the long processes that involved raising the ICBM and fueling it with XXXXXXXX. This mission overall caused Crumbs to lose faith in the standard issue helldivers. This caught the attention of the person with the callsign “Steroid” promising “Greater opportunities” and “specialized divers”. \nTrauma and PTSD:\nAs mentioned before, Crumbs has a rare case of not appearing to have any forms of stress-disorders or any trauma. Super-Earth Doctors have examined his brain through multiple different scans. And have noticed severely less brain activity in the part where a person feels sorrow or regret, the activity being more active in parts where feelings of retribution, redemption, revenge, and vengeance. Scientists suggest the early exposure to the element E-710 may have caused his younger self’s developing brain to develop differently causing his interesting condition. Scientists trying to cure his condition realized how great this could be for all Helldivers, creating a batch of highly experimental E-710 pills for a group of select children of varying intelligence. Experiment:XXXXXXXXX was tough to carry out and the results were quite varied. No matter the intelligence of children, the effect of the pills didn’t seem to do much. Kids either get full on brain damage, hyper focus, full-body paralysis, or receive no pain. This experiment was an overall XXXXXX and this subject needs to be further researched upon.\nService in the 101st:\nAfter enlisting through Steroids affirmation. He was a private\nunder Steroids rule. Crumbs spent most of his free time doing XXXXXXX and XXXXXXX. Though he didn’t know it, most of his sargents kept a keen eye on him. Quite quickly, Crumbs went from private to corporal very quickly. As he showed his sharp skills on the field, ordering privates around though he was still a private. Being a new corporal. He started to create a slew of deployments, attacking the automaton frontline and repelling the bugs. Multiple cases from privates (Who are sadly not with us anymore) tell us how his leadership skills were like no other. Delivering orders like no other, while still watching out for his team. One private said “Dude! Crumbs is crazy, like he took one glance at the map and identified a stalker lair right after we dropped down!” Unfortunately, PVT-XXXXXXXX died in a stalker encounter after the aforementioned deployment. Through a series of major orders and mass deployments, Crumbs climbed the ranks quickly leading to who he is today.\n"},"Personnel-Files/personnel-file-gael":{"title":"Personnel File IAC-08 Gael","links":[],"tags":["personnel-file"],"content":"101st “Hell” Battalion\nMilitary Personnel File\n\n\n\n\n\n\n\n\n\n\n\n\n\nCodename: IAC-08 “Gael”Name:  ██████████Rank: CaptainDOB: ██████“Ad Victoriam Pro Terra Aeterna”                       -IAC-08 “Gael”\nDuties:\nCaptain of the Eurasian Company, he is a tough, but strong leader. Leading his many platoons to victory no matter the adversary, from the scorching temperatures of Hellmire, dense jungles of Malevelon creek, to the freezing temperatures of Marfark. He uses real-life tactics to strategize in tough situations, saving the lives of many, divers or civilians apart.\nOperational Conduct:\nGael is quite the team player when it comes to his fighting style, Most of the time running the team’s designated Anti-Tank class. Using his trusty Recoilless rifle paired with many eagle strikes and orbitals. Due to his “high impact” playstyle, he prefers using heavy armor, starring the Kodiak and Winter Warrior Armors as his main gear. \nMilitary Career:\n At the start, Gael was born into a loving and caring family on Super Earth. His Mother and Father named ███████ and ████████ w with two younger siblings, ██████████ and █████. Him being the oldest, he was destined to be the one who watched over the kids. His father, a high-ranking official of “Morgunson” Used his high clearance level to access weaponry that many civilians can not access. This gave the ability of Gael’s dad to provide firearms that most of the Helldiver Corps used frequently. Often bringing young gael to private shooting ranges stationed at where he worked, having one-to-one sessions teaching how to shoot. Of course, a kid with such expertise was out of the ordinary, he was enlisted as a sergeant in the SEAF and was stationed on many E-710 farms. Being able to eradicate dissidents so well he caught the attention of many, leading his quick enlistment to the Helldiver Corps. Gael was quite the unit, quickly stomping down and wiping our dissident cells for about 3 years. Once the terminid scourge started to become a major threat, he was recalled from his haven and put to the frontlines to deal with bug infestations. Gael as a Helldiver proved no issue for him, charging at the frontlines many bug planets, including the frigid planet of Estanu and and the smokey deserts of Erata Prime. He didn’t go unnoticed, gaining many medals for his actions and leadership. Several privates have seen him “tear a bug in half while it was alive” by using the snowshoes on his armor to stomp hunters and scavengers.\n \n \n \n\nRecruitment to the 101st “Hell” Battalion:\nAfter his many deployments, he eventually caught the attention of BM-01 “Mind”. Who at that time, was starting to develop the early roots of the 101st. Given his skills, Gael was quickly pulled into the battalion. Mind saw Gael fight the automaton menace aboard his Super Destroyer, using his eagle-eye to closely monitor the actions and decisions Gael takes. The automatons which wiped out many civilian settlements did not seem to have any mental toll on Gael, him simply being there to finish a job, which Mind liked a lot about him. Gael had a “no-bullshit” attitude dealing with the main objective, and some sides before leaving. Though Gael liked to work with the Helldiver corps, he never grew any real attachment to the group, and gladly joined the 101st when Mind approached him after they extracted.\nTrauma and PTSD:\nGael has an interesting case for his trauma. Since he was the one who protected his younger siblings in school, he grew up in violence. His younger siblings would be frequently bullied, mostly due to their heritage. And often having young Gael knock them out on the sidewalk. His early exposure to violence and his early exposure to firearms from his father molded him into the captain he is today. His time fighting also contributed to his desensitization of trauma and PTSD. Frequent losses of poor divers and shellshock led him to simply not have any real feelings toward any morally debilitating losses on the battleground. Instead of grieving the loss of a subordinate, he would change that sorrow into anger, often being seen shooting the bodies of the automatons or ripping the terminid that killed a diver.\nService in the 101st:\nGael moved up the ranks with Steroid as well, being under command of Freeze and Mind. Gael worked quite well with Steroid, both having relatively similar interests and hatred, but still having wildly different experience working for the SEAF and early childhoods. They would spend most of their time going into deployments together as well as goofing around in the mess hall. His skills were unmatched in different ways, preferring to stick with the fireteam and not going solo like others. Having zero issue with ordering his subordinates around. Pushing the automaton front, and being able to use his sharp senses to hear and see patrols from extreme distances. From the thumps from hulks or the steady humms from a tank. He would be able to identify a threat when they are not even remotely near histeam. Many privates under his command have seen him look at the track of a bot patrol and accurately described each footprint, from the spacing and pattern of the track he was able to determine that there were 3 troopers, 4 devastators, 3 berserkers and 1 hulk. He has also been noted to blast off the face of a bile titan, just under 10 meters away from him, spraying the surrounding area and him with green goop from the blast of his trusty Recoilless Rifle. Gael quickly climbed the ranks, due to the massive vacancy currently available during the start of the battalion, he was raised from private to corporal quickly. Getting trained from Freeze and Mind, he rose to sergeant and quickly to the Captain. After being inactive for a bit, he was quickly put back into service and to this day, still the bold leader of the Gael/Eurasian Company.\n"},"Personnel-Files/personnel-file-steroid":{"title":"Personnel File BM-02 Steroid","links":[],"tags":["personnel-file"],"content":"101st “Hell” Battalion\nMilitary Personnel File\n\n\n\n\n\n\n\n\n\n\n\n\n\nCodename: BM-02 SteroidName:  ██████████Rank: Battalion MajorDOB: ██████With the permission of Super Earth HighCommand, Battalion Major Steroid has been granteda processed version of E-710 for medical and recreational purposes.\nDuties:\nServes as Second in Command of Freeze company within the battalion, assisting captain Freeze in command responsibilities. He plays a pivotal role in strategic planning, logistical coordination, and decision-making. Additionally, he commands Steroid Platoon, leading his soldiers in front line engagements against humanity’s enemies.\nOperational Conduct:\nDemonstrates exceptional battlefield awareness and strategic command, effectively preventing tunnel vision among squad members during critical engagements. His predominant use of a jetpack enhances maneuverability, allowing him to gain tactical advantages and execute high-impact strikes with his specialized “Bullfrog” demolition class. This approach focuses on neutralizing major threats and key enemy infrastructure using a combination of the quasar cannon, scorcher rifle, and eagle airstrikes, ensuring mission success and maximizing the combat effectiveness of his unit.\nMilitary Career:\nMilitary career began under extraordinary circumstances. As a child survivor of an Automaton invasion on his homeworld, he was rescued by a Helldiver corps during a planetary liberation campaign. Raised within the corps, he gained early exposure to military operations, supporting Helldivers on super destroyers and mastering their tactics. His unique upbringing and exceptional skills led to early induction into active duty, bypassing age regulations. Quickly ascending through the ranks due to his invaluable battlefield insights, Lieutenant Steroid caught the attention of the elite 101st “Hell” Battalion. Recognized for his potential to enhance the unit, he was recruited to lead a platoon, where he has since been instrumental in mentoring emerging heroes and bolstering the battalion’s strength and reputation.\nAddendum 1: \nOperation Log of Helldiver squad Alpha Recon 6\n— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — Date: [REDACTED]\nLocation: [REDACTED]\nOperation Code: Op-317X\nSquad Name: Alpha Recon 6\nSquad Leader: Sergeant Marcus ████\nObjective:\nConduct a search and rescue operation in response to an Automaton attack on civilian residences in sector 47-B.\nBackground:\nThe region had recently suffered a devastating assault by Automaton forces, resulting in significant destruction of civilian infrastructure and numerous casualties. Intelligence reports indicated possible survivors trapped in the area, necessitating an immediate Helldiver intervention to locate and rescue any civilians and assess ongoing threats.\nLog:\nDeployment at dawn, with the team fully equipped for urban search and rescue under potentially hostile conditions.\nInitial assessment revealed extensive damage; several residential blocks were demolished, with fires still burning in some areas.\nAt 0530 hrs, amidst the wreckage of what was once a housing complex, Corporal Jenkins detected a faint heat signature.\nInvestigation led to the discovery of a young boy beneath the rubble, identified as Jacob Jenssen. The child was in shock, showing signs of emotional distress and physical injuries.\nImmediate first aid was administered, and the child was comforted by Specialist Tara Lee, who has training in psychology.\nThe team secured the perimeter, confirming no immediate Automaton threat in the vicinity.\nArrived at the designated safe zone at 0630 hrs, where the child was transferred to SEAF foot soldiers\nOutcome:\nMission successful with the rescue of one child survivor. The area was secured, and no Automaton threats were encountered during extraction. The survivor is under medical care and will receive ongoing psychological support due to potential trauma.\nLeader’s Notes:\nThe squad performed very well, exactly as trained. I can’t help but feel sorry for the young boy we rescued. He probably lost his entire family to these heartless monsters. The squad is worried that the boy might have nowhere to go.\nAddition 1:\nA few weeks after the deployment, the medical department contacted us and informed us that the boy had fully healed up but had nowhere to go. He would have to go into foster care on another Planet. After a long discussion with all of my squad members, we decided to adopt the boy and take him with us. He will be living on the super destroyer and we are currently waiting for him to be transferred.\nAddition 2:\nThe boy has been on the ship for a few days now but has not spoken a single word with any of us, except for Tara. He opened up to her about what he saw that day and broke down right after. He wept uncontrollably for a few hours while the squad tried to comfort him by any means possible. He’s asleep now in a makeshift room we set up for him. I really hope he gets better with time.\nAddition 3:\nAfter a few sessions with his psychiatrist, the boy seems to be in a better mood now. He started helping around on the ship and has been talking to all of us. We are very relieved that he is doing better. He tried carrying an Autocannon the other day all by himself and promptly dropped it on the floor. Ryan started calling him “Steroid” after that and the name stuck with him. \nAddition 4:\nSteroid talked to me and said that he wants to become a helldiver, like us. I tried to tell him otherwise but he insisted. He really wants to and brought it up multiple times to the entire squad. I have talked with my higher ups and managed to organize a personal trainer for him to surprise him with his first training session tomorrow. I do have a few concerns about him starting such intensive training at his young age, but the boy has already seen things nobody should ever see in their lives and as far as I’ve noticed, he seems very capable.\nAddendum 2: \nPsychological development report of Jacob Jensen\n— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —\nSubject: ██████ ███  aka “Steroid”\nDate of Birth: [REDACTED]\nPsychiatrist: Dr. Lisa Grant\nInstitution: SEAF Operational Support Unit\nReport Date: [DATA EXPUNGED]\nIntroduction:\nThis report summarizes the psychological development of ████████████ , also called “Steroid”, a young boy who was rescued by Helldiver squad Alpha Recon 6 during a mission in sector 47-B on [REDACTED] following an Automaton attack. Since his rescue, he has been adopted by his rescuers and resides on the super destroyer SES ████████████, periodically leaving for his helldiver training in the Sol system. The following logs reflect his adaptation to his new environment and his psychological growth from a trauma survivor to a Helldiver trainee.\nSession Logs\nSession 1: Week 1 of therapy\nExhibited symptoms of acute stress reaction, characterized by detachment and sporadic periods of hyper-alertness. The initial assessment showed a high level of resilience despite significant trauma. After being informed about his adoption by Alpha Recon 6, his symptoms seemed to improve slightly.\nSession 5: Week 5 of Therapy\nBegan to form attachments with members of the squad, particularly Specialist Tara Lee, who has taken a maternal role. He showed initial interest in the daily routines of the squad, asking numerous questions about the duties of a Helldiver. His mood appeared more stable, with increasing periods of contentment and curiosity.\nSession 12: Week 14 of Therapy\nEnrolled in the Helldiver training program with a personal trainer before moving onto bootcamp and simulated missions. Has shown remarkable adaptability and eagerness to learn. His physical coordination and endurance have improved significantly. Socially, he is much more engaged and has started forming deeper relationships with peers and instructors.\nSession 20: Week 23 of Therapy\nConfidence has grown immensely; often volunteers for tasks during training sessions. His instructors report that he shows a natural aptitude for strategic thinking and combat training. Psychologically, he appears to have found a sense of belonging and purpose, which has greatly contributed to his overall happiness and well-being.\nSession 38: Week 51 of Therapy\nAs Steroid approaches the one-year mark of his adoption into the Helldiver squad, he has blossomed into an outgoing, enthusiastic young trainee. His resilience has transformed into a leadership trait, often seen helping newer trainees. His psychological profile indicates a significant decrease in trauma-related symptoms, replaced by a strong sense of identity and community.\nEnd of Therapy\nAddendum 3:\nTraining Progress Report of ████████████\n— — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — — —\nTrainee: ████████████  aka “Steroid”\nDate of Birth: [REDACTED]\nPersonal Trainer: Specialist Alex ██████\nReport Date: [REDACTED]\nIntroduction:\nThis report outlines the training progression of ████████████ , also referred to as “Steroid”, starting from his personal sessions on the super destroyer of Alpha Recon 6, to his current status. Notably, ████████████ is the youngest trainee ever admitted to the Helldiver training program.\nTraining Logs\nPhase 1: Personal Sessions\nStart Date: [REDACTED]\nSteroid began his training under my direct supervision aboard the SES ████████████. Early sessions focused on basic physical conditioning and combat readiness drills. Despite his young age, Steroid displayed remarkable determination and quickly mastered basic combat tactics and weaponry handling.\nProgress Assessment: Steroids agility and quick learning ability allowed him to excel at his training, significantly improving his endurance and basic combat capabilities, allowing him to move on to helldiver bootcamp on Super Earth.\nPhase 2: Helldiver Bootcamp on Super Earth\nStart Date: [REDACTED]\nSteroid transitioned to the more structured environment of the Helldiver Bootcamp on Super Earth. The curriculum expanded to include advanced tactical training, Stratagem management, survival skills, and enhanced physical conditioning. His ability to adapt to diverse combat scenarios was notably impressive.\nProgress Assessment: Demonstrated leadership in team operations and critical thinking in high-pressure simulations. Recommended for advanced training given his rapid acquisition of skills.\nPhase 3: Advanced Training Facility on Mars\nStart Date: [REDACTED]\nThe current phase involves specialized training in extraterrestrial warfare tactics, including combat in different environments and advanced navigation techniques. Steroids performance remains exceptional, with notable achievements in environmental adaptation and combat resourcefulness. The negatives include a substantial increase in stress and also a small return of the trauma symptoms that were reported by\nDr. Lisa Grant\nProgress Assessment: Continues to show growth in strategic combat engagements and has been selected for early enlistment into the helldiver corps by the SEAF.\nRecommendations for Further Development:\n\nRecruitment into an elite helldiver unit\nIncrease in leadership responsibilities \nGranting of a medical substance to decrease stress and to minimize the risk of the Trauma symptoms returning\n\nEnd of report\n"},"Resources/Chain-of-Command/command-structure":{"title":"Command Structure","links":[],"tags":[],"content":"\nThe Battalion\nThe whole of the 101st, led by Battalion Commander Mind, with Majors providing support. Composed of 4 Companies:\n\nStells Company\nHopman Company\nCross Company\nMarnne Company\n\nCompany\nA company is led by a Captain (IC) is composed of four platoons. One platoon is led by a Lieutenant, who also serves as second in command (2IC) of the company. The other three platoons are led by Second Lieutenants.\nPlatoon\nLed by a Lieutenant or a Second Lieutenant. Composed of 4 Squads. 3 of these are led by Sergeants, and 1 is led by a Sergeant Major who is also 2 IC of the platoon.\nSquad\nThe most basic unit of the 101st, containing 10 members:\n\n1 Sergeant (IC)\n1 Corporal (2IC)\n8 Private\n2 Specialists (SPC)\n\n"},"Resources/Deployments/Templates/deployment-templates":{"title":"Deployment Templates","links":["Resources/Deployments/departure-course","Resources/Deployments/deployment-tallie-guide"],"tags":[],"content":"If you are a new SPC or you need to fresh up your memory on how departure notices work read this guide by SL Ain\nDeparture Notice Template\n\nIf you are a new SPC or you need to fresh up your memory on how tallies have to be written read this guide by SL Ain\nDiscord Tallie Template\nSITREP Template\n"},"Resources/Deployments/departure-course":{"title":"Departure Course","links":[],"tags":["tallies","ressources"],"content":"This will be a short course or Reminder on how to create and manage Departure Notices. If you have any Questions after this please feel free to message your Commanding Officer and if they are not reachable the Person above them.\nI’m going to be splitting this Guide into 2 different Segments:\nDeparture Creation\n\nCreation\nFormatting\n\nDeparture Rules\n\nRules for Channel\nRules for Deployment\nRules for Pinging Members/Backup\n\nDeparture Creation:\nCreation:\nCreating a Departure only takes a few things, a Deployment Signup with at least 3 Members including yourself and also a given time for when the Deployment will be happening.\nIn the “helldive-departures” channel you can find a pinned message by our Lord and Savior himself about how you could write your Departure Notices.\nThe important Bits are: You need a header such as “Attention Helldivers”, a broadly written message including the Deployment name and when the Deployment starts, written in a Roleplay like fashion such as “Operation: “For the Battalion” has been approved by Super Earth High Command and will Commence in T-15 Minutes” and Pings for each of the Members. Below the pinged deployment members you are required to write a roleplay text in fashion of addressing the members as soldiers you are to take into battle. Something uplifting.\nIt could look something like this:\n\nAfter this is done you just have to hit enter and send your Departure Notice.\nFormatting:\nThere are a few formatting rules you have to follow when writing a Departure Notice:\n\nA header that states a variation of “Attention Helldivers”\nThe Operation Name and time till Deployment start\nA Ping for every signed up Helldiver excluding yourself\nA different Section for Pinging Main Divers and Backup Divers\nSignificant RP Elements\nA 15 minute departure notice is required. An 1 hour departure notice is optional.\n\nDeparture Rules:\nRules for Channel:\nThe Departure Channel is only to be used to post the 1 Hour Departure Notice and 15 Minutes Departure notice. Anything else that has to do with the Deployment will be sent in either the Hub or in Dms. If for example you wish to inform the assigned Helldivers that you will be opening the Comms soon do so in the Hub. DO NOT make a separate message in the Departure Channel about you opening Comms.\nEach Departure Notice must at least have a bit of Roleplay in it and will not be allowed to be too short. You can use the given Example above as a guideline of what is an acceptable length.\nThere may be two Departure Notices. There must be a 15 min Departure Notice. More than that is prohibited. The only exception to this Rule are the Hot Drop Deployments which you can host on Weekends. They only require the 15 Minute Departure Notice.\nDo not have any casual chatter in the Departure Notice channel. If anything needs to be said, do it in another Channel.\nRules for Deployment:\nThe Mission will start at the time given beforehand. If you set the Mission Start Time at 19:00 in the Signup then Members have time to join you till 19:00. If any of the main Mission Members have not shown up by then, they will get five extra minutes to join the Deployment. At 19:00 you are then requested to ping them in the Hub or in DMs to inform them that the Mission will be starting soon. If they do not respond within 5 Minutes you can ping one of your Backups again in either the Hub or Dms. If you do not have any Backups you can open the Deployment up to the entire battalion and also ask anyone you see in a voice channel if they wish to join you.\nIf one of the Members is misbehaving within your Deployments and does not better himself after you mention it to him, then you have the right to kick them and can also disconnect them from your Deployment VC (you have the ability to disconnect people from your own deployment vc). \nDo not abuse this. If High Command finds out you are abusing this there will be repercussions.\nDeployments have a few given rules that have been set up by High Command:\n\nDeployments must have at least 3 members.\nDeployments must have a total time of at least 45 minutes. (note TOTAL time. Not specifically IN MISSION time)\nDeployments must consist of 3 drops. (even if you fail one, as long as you still do three it counts)\nDeployments must take place in an official deployment voice channel.\nDeployments must have a properly written departure notice(s), and a properly written tally to count.\nDeployments must be hosted in difficulty T5 to T10. Anything below T5 will not count. \n\nAll 6 of these criteria must be met for the deployment to count. If even one of these is not met, it will not count.\nRules for Pinging Members/Backup:\nAs already stated above in Deployment Rules, if you wish to Ping the Members or Backup you will use the Hub Channel or Dms NEVER use the Helldive Departures channel outside the 1 Hour and 15 Minutes Departure Notice. \nIf for some reason one of your Squad Members lose connection or have to leave in the Middle of the Mission, you are free to call in your Backup. Give them a Ping in the Hub or DMs.\nThis Concludes this Course on Departure Notices. I hope this was helpful. Again if you have any more questions after this feel free to Message your Commanding Officers. I wish you all a wonderful day!\nSecond Lieutenant Ain signing off\n"},"Resources/Deployments/deployment-tallie-guide":{"title":"Deployment Tallie Guide","links":["points"],"tags":["guide","ressources","deployments","medals"],"content":"This will be a short course or Reminder on how to create and manage Departure Notices. If you have any Questions after this please feel free to message your Commanding Officer and if they are not reachable the Person above them.\nThis Guide will be split into 2 Parts:\nTallie Formatting\n\nPotential Templates\nDeployment Header\nMission Reports\nAdditional Information\n\nTallie Rules\n\nRules for Information\nRules for Attendance\n\nTallie Formatting:\nPotential Templates:\nThere are 2 given ways to write a Tallie. One is with a direct Message in the Discord following a given Template for the Header that will be discussed in a later point. This will require you to write each Mission separately as its own Report such as\n\nIn here you can see that the Tallie is split up into 3 Different Sections with a Mission Report for every Mission. If you need any help or ideas for writing a Tallie there is also a Template pinged in the channel made by Battalion General Mind: 101ST MISSION REPORT\nThe other way is to use a google docs template made by previous Sergeant Major Raisin, where basically everything is given. If you need any help with it feel free to check out Tallies made by other people. Do keep in mind that this version still needs the Header and will also not work properly if you do it on your Phone.  You can find this Version in the pins of the Tallie Channel aswell: The Expendables, Team #2 SITREP.\nFeel free to make a copy of this and Edit it to fit your Deployment.\nDeployment Header:\nThe 101st has a specific Deployment header that is supposed to look almost identical every single time this header looks like this:\n## OPERATION REPORT\nOperation: &quot;Operation Name&quot; \nYear-Month-Date (Time in UTC+2 24 Hour Clock)\nDifficulty: T?\nLocation: Planet\nSquad Leader: \n@Yourself\nSquad: \n@Diver1\n@Diver2\n@Diver3\n\nYou are requested to put this Header above every Tallie no matter what kind of tallie.\nMission Reports:\nMission Reports are made for each individual Mission. You are free to write this however long you want, there is a minimum you shouldn’t go under which is about 6 Sentences and about 3 Lines. Make sure that the Mission Reports never end up too short. You are free to write basically anything in it that happened in the Mission, just make sure to write it in a Roleplay like fashion and make it look like an actual mission report.\nAdditional Information:\nYou are also free to add additional Information to your Tallie that you think might be important to know. For example if there is a special Theme or purpose on the Deployment feel free to make an extra section above the Mission reports to inform the reader of said purpose. For example if you are hosting a Specialist training Deployment you could add something like this:\n\nYou could also add a few notes at the bottom about how the Deployment went and the specific performance of the Members within said deployment:\n\nThese are optional but are always nice to see in Tallies.\nTallie Rules:\nRules for Information:\nAs stated above there is a necessary amount of Information to be given within a Tallie.\nYou are always required to make 3 Mission Reports and make these Mission Reports at least 6 Sentences and about 3 Lines. If you do not follow these rules you will be asked to redo the tallie to make it count for attendance. The Header will also always be necessary. A tallie without a header will not be accepted and you will be notified of your mistake which you will need to fix.\nIf you do not fix it you will be getting any points from said Deployment.\nRules for Attendance:\nIn a Deployment you might encounter someone being unable to finish the entire Deployment and has to leave for example after the second mission and you have to call in a Backup.\nLet’s say Diver1 wasn’t able to finish the Deployment due to his Wifi going out and\nDiver2 had to jump in in order to finish the Deployment.\nSince Diver1 left before the Deployment was finished he will not be awarded any attendance Points for this deployment and his Point will be given to Diver2 since he replaced Diver1.\nIn your Tallie you will only be asked to Ping the people that actually finished the Deployment and Diver1 would not get mentioned within the Header:\nOPERATION REPORT\nOperation: “Operation Name”\nYear-Month-Date (Time in UTC+2 24 Hour Clock)\nDifficulty: T?\nLocation: Planet\nSquad Leader:\n@Yourself\nSquad:\n@Diver2\n@random\n@random\nThis concludes this guide on Deployment Tallies. I hope this helped and if you have any further Questions please ask your Commanding Officer with them.\nSecond Lieutenant Ain signing off\n"},"Resources/Deployments/mission-types":{"title":"Mission Types","links":[],"tags":["deployments","tallies","ressources"],"content":"Enemy Agnostic\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPump Fuel to ICBMUpload Escape Pod DataConduct Geological SurveyLaunch ICBMRetrieve Valuable DataEmergency EvacuationRetrieve Essential PersonnelSpread DemocracyTerminate Illegal Broadcast\nAutomatons\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBlitz: Search and DestroySabotage Air BaseEliminate Automaton Factory StriderDestroy Command BunkersNeutralize Orbital DefensesEradicate Automaton ForcesSabotage Supply BasesEliminate Devastators\nTerminids\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEliminate ChargersActivate E-710 PumpsEliminate Bile TitansPurge HatcheriesEradicate Terminid SwarmActivate Terminid Control SystemEnable E-710 ExtractionEliminate Brood Commanders\n"},"Resources/acronyms-abbreviations-slang":{"title":"Acronyms Abbreviations Slang","links":[],"tags":["rank","ressources"],"content":"\nCommunication and Abbreviations\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbbreviationMeaningSeenCopy, Understood, YesCOCommanding OfficerJCOJunior Commanding OfficerSCOSenior Commanding OfficerHQHeadquartersHCHigh CommandICIn Command2ICSecond in Command\nAcronyms\n\n\n\n\n\n\n\nFireteam LeaderLeads Part of the Squad while in a Deployment; not Deployment Leader\nRanks\nEnlisted:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCDTCadetPVTPrivateSPCSpecialist\n\nJunior Commanding Officers:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCPLCorporalSGTSergeantSMSergeant Major\n\nSenior Commanding Officers\n\n\n\n\n\n\n\n\n\n\n\n\n\nSLSecond LieutenantLTLieutenant\n\nCommanders\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCCCompany CaptainCMMajorBCBattalion Commander\n\nReinforcements\n\n\n\n\n\n\n\n\n\n\n\n\n\nNMCNull Mech TrooperMTMech Trooper\n\n"},"Resources/deployment-course":{"title":"Deployment Course","links":[],"tags":["ressources","deployments","guide","medals"],"content":"\nThis will be a short course or Reminder on how to create and manage Departure Notices. If you have any Questions after this please feel free to message your Commanding Officer and if they are not reachable the Person above them.\nI’m going to be splitting this Guide  into 3 different Segments:\nSignup Creation\n\nCreation\nTheming  \n\nSignup Editing\n\nChanges\nInforming People of Changes\n - Rules for Changes\n\nSignup Removal\n\nReasons for Removal\nProcedure for Removal\nInforming People of Removal\n\nSignup Creation:\nCreation:\nFirst of head into the “Deployment-Signup” Channel within the Discord, this is where you will be posting your Signups. After doing so go to the Message Bar and write \n“/Event Create” and click on the event create Option. Afterwards you should see this:\n\nEvent Creations are split up into 3 parts:  the title, the event start and the Description.\nThe title can be anything you want to call it for Example you could just type Operation:“name” in it but this is solely up to you.\n\nAfterwards you set the Time of the Deployment. You will type in the “event_start” Option in  this format: year-month-day time an example would be this:\n\nBe advised: The time has to be written in the 24 Hour Clock in UTC+2.\nYou will have to adjust this in order to set correct times for your Deployments.\nIf for example you are one hour ahead in UTC+3 and it is 24:00 for you and the next day has started. You would have to set the date a day back since it is only 23:00 and the day before in UTC+2\nLast but not least you can add a Description by clicking in the Chat Bar outside of any of the already given templates. There you see Options of what you can do but the only important one is the “Description” option. Click this again and you will add a field for your Description. In this you can type anything you want to do in your Deployment.\nFor example, if you wish to host a Deployment on the Automaton front on Difficulty 9 with only Barrages you could type it up like this:\nAfter you have done all of the Above your deployment Signup should look something like this:\n\nor like this\n\nOnce you have done all of these Steps you can just hit enter and the Bot will automatically create your Signup and all you have left to do is be sure to Join your own Deployment.\nTheming:\nThe theme of the Deployment is completely left up to you, all you have to do is to make sure to write anything specific you want to do within the Description in order for everyone who signs up to know what will be happening in this Mission.\nSignup Editing:\nChanges:\nIf you need to change anything within your existing Deployment just go into the Chat bar again and type in “event edit”, click on the Option which will prompt a window that should look like this:\n\nHere you have 3 fields that need to be filled out. First is the event id. If you click on it it should display all currently ongoing deployments. If you wish to find your deployment then you just need to click on the Deployment that has your name in it. After this is done you can click on the certain “Field” you want to change, for example if i wish to change the time of the deployment due to me being unable to host at the given time i can click on the “event start” Option, which will then prompt me to assign a new value to the event start time.\nYou will have to Type in the entire time again in the format given on the previous page. Let’s say i want to change the time from 15:00 to 16:00 I’d have to type it like this:\n\nThe same goes for the Description and title. If you want to add something to your description then you need to copy the existing Description and add anything in it.\nAfter you have done this you can just hit enter and the Bot will automatically change anything you wanted to change.\nInforming people of Changes:\nOnce you have changed either the time or Description of the Signup after people have already joined the Deployment just inform them in the Hub or in Dms with a small message that pings them and states what you changed, for example like this:\n\nRules for Changes:\nIf you are planning on changing either the time or adding more Conditions to the Deployment Description then you will be required to inform already existing members in the Deployment signup, that is either within the main Deployment or the Backup of said changes. If you fail to do so and a person does not wish or can not attend the Deployment any longer then it is on you and the person who does not attend is not at fault and will not be held accountable.\nSignup Removal:\nReasons for Removal:\nThere are 2 Main Reasons for Deployment removal:\n\nThe Deployment has ended and the Signup is just taking up Space.\nWhenever you finish a Deployment you are asked to remove your own Deployment Signup in order to not cluster the chat with already finished Deployments.\nYou will not be able to host the Deployment and need to cancel it.\nIf you are ever unable to host the Deployment due to whatever reason please remove it in order to not confuse people with a non-existent Deployment.\n\nProcedure of Removal:\nIf you wish to remove your Signup you again go into the chat bar and type in “event removal”\nBe sure that it is removal and not “event close” ,these two options do different things.\nOnce you have done so you again just choose your event Id and click on it from the list given above the chat. Once you have chosen your Signup you just hit enter and the Bot automatically removes your signup. BE WARNED you are able to remove other people’s signups so make sure you only select your own to not cause confusion about missing signups. If you get caught doing this you will be punished.\nInforming People of Removal:\nIf you have removed the Deployment signup for reason 2. You will need to inform anyone signed up as either Main Squad or Backup of the removal.\nAgain you will do this in the hub or Dms using a small message that states which deployment it is and give the reason (as long as it isn’t too personal) of why you did so, for example like this:\n\nAfter you have done this you fulfilled your role in informing anyone involved of the cancellation of the Deployment and can go about your day.\nCongratulations Helldivers now you know how to manage your Deployment Signups!\nIf you have any other Questions feel free to message your CO’s with these Questions.\nI hope you all have a Wonderful day. At ease Soldiers!\nSM Ain signing off.\n"},"Resources/external-resources":{"title":"External Resources","links":[],"tags":[],"content":"\nBattalion Roster\nYou can find most information about Company’s Platoons Squads and individual members in the Battalion Roster.\nBattalion Steam Community post\nSCO Leadership Course\n\nTech Department\nDetailed Data Sheet Enemy Weak Points and Damage Numbers\ndocs.google.com/spreadsheets/d/e/2PACX-1vRBrOIXQIYaOBNw8v9zRX4Qj8BDP0xaMTAzGhL1Tv6QxOU43RXM_ByDHwk4xw_HRjsCXhpif-jUlQAn/pubhtml\n101st Tech Document:  Armor Penetration and Weak Points explained\ndocs.google.com/document/d/1uBE9SS0gcKGBTMJQ02LuG0LV79A2OtrJipnDjtRZVSk/edit\n101st Tech Document: Health and Armor\ndocs.google.com/document/d/12fqZmm1_1GoQFq-aabzwHPujTtprDQ4ua5nC_ck-mPU/edit\n"},"Resources/medals":{"title":"Medal System","links":[],"tags":["ressources","medals"],"content":"\nMedals demonstrate excellent dedication or service to the 101st. Medals are grouped into 4 tiers\n\nBronze\nSilver\nGold\nDiamond\n\nNon SPC and J/SCO\nthe only medals you can’t get are the Deployment Host Medals, and the Trainer Medals to get them you will need to climb the ranks of the Battalion\nIndex\n\nService medals\nRecruitment Medals\nDeployment Host Medals\nDeployment Attendance Medals\nMedia Medals\nTrainer Medals\nDiamond Medals\n\n\nService medals\navailable to\nEveryone\nService Medals, embodiment of patriotism and valor, are bestowed upon those whose unwavering initiative, boundless dedication, unyielding loyalty, inspirational leadership, or unmatched excellence stand as a testament to the highest ideals of our nation. These prestigious accolades, which honor deeds beyond the ordinary, serve as beacons of honor and recognition within our esteemed ranks.\nTo earn the privilege of donning a Service Medal, one must exemplify the utmost dedication and merit. A commendation from a Commanding Officer serves as the initial beacon of recognition, highlighting the exemplary conduct of a deserving candidate. This recommendation, laden with evidence and fervor, is then presented to the discerning gaze of the Captain, whose final decision holds the weight of our collective ethos.\nIn this intricate tapestry of valor and recognition, Commanding Officers meticulously select candidates whose deeds shine brightest amidst the fabric of service, offering compelling narratives that underscore the profound impact of their actions. Thus, each bestowed medal not only signifies individual merit but also celebrates the enduring spirit of camaraderie and patriotism that courses through the veins of our noble institution.\nRequirements: Active member, Hosts deployments (if able) and doesn’t leech, responds to deployments, attends events and helps with documentation.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBronze Service MedalSilver Service Medal (must have bronze service medal before)Gold Service Medal (must have silver service medal before)\n\nRecruitment Medals\navailable to\nEveryone\nRecruitment Medals are awarded for introducing large numbers of new cadets into the community. We keep track of the members that join using your discord invite link with our bots.\nMake sure you invite people with your own link so we can track it!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMedal TypeRequirementsBronze Service Medal5 members recruitedSilver Service Medal (must have bronze service medal before)12 members recruitedGold Service Medal (must have silver service medal before)20 members recruited\n\nDeployment Host Medals\navailable to\nSPC and up\nDeployment Host Medals are awarded for hosting large numbers of deployments with your members. Those interested in Deployment Host Medals should keep a log of contracts they run through the deployment-tallies channel in the Discord.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMedal TypeRequirementsBronze Service Medal8 deployments hostedSilver Service Medal (must have bronze service medal before)24 deployments hostedGold Service Medal (must have silver service medal before)56 deployments hosted\n\nDeployment Attendance Medals\navailable to\nEveryone\nDeployment Attendance Medals are awarded for attending large numbers of deployments, including as the deployment leader. Those interested in Deployment Attendance Medals should keep a log of deployments they attend, noting the date and the deployment leader keeping an eye out for the deployment tallies channel in the Discord.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMedal TypeRequirementsBronze Service Medal15 Deployments attendedSilver Service Medal (must have bronze service medal before)35 Deployments attendedGold Service Medal (must have silver service medal before)70 Deployments attended\n\nMedia Medals\navailable to\nEveryone\nMedia Medals are awarded for receiving large numbers of views on social media, including instagram, tik-tok, twitter, youtube. Keep in mind that only the content that is related strictly to the 101st Hell Battalion counts towards this medal!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMedal TypeRequirementsBronze Service Medal800 viewsSilver Service Medal2k viewsGold Service Medal5k views\n\nTrainer Medals\navailable to\nDrill Sergeants\nMedal is awarded to drill sergeants who have taken new cadets through training drops and written the subsequent tally for said drops. The count of cadets per drop does not matter, the number of training drops is what counts toward the medal.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMedal TypeRequirementsBronze Service Medal8 training dropsSilver Service Medal16 training dropsGold Service Medal32 training drops\n\nDiamond Medals\nThe Diamond medal is only awarded to people that hold at least 4, or more GOLD MEDALS.\nAn official Awarding Ceremony needs to be held when giving away a Diamond Medal in the general VC inviting the whole community to salute our bravest troops with outstanding dedication.\nBased on all of this information, your “medal” role in the server will be equal to the highest medal you own. Meaning you can have only 1 “medal holder” role!\n\n"},"Resources/rank-responsibilities":{"title":"Rank Responsibilities","links":[],"tags":["ressources","rank"],"content":"\nCadet\nyour only responsibility is to make sure to get your first training as fast as possible so you can be placed in a Squad and to become a Private\n  Private \nyou don&#039;t really have any responsibilities just follow the rules, [[deployment-concept-overview|Join Deployments]] and have fun dying for the Battalion\nSpecialist \nSpecialists need to Host at least 1 deployment per Week and need to be active in The general and in the squad Chat If your Sergeant allows it you can host &quot;Squad only Deployments&quot;\nCorporal\nCorporals are squad 2ICs, meaning they support the squad&#039;s Sergeant in leading the squad, helping them to complete their duties when they are online and taking charge when they are not. As a Corporal, you will often be the first point of contact for Troopers in your squad with requests, complaints or questions. You should be able to help them with their problem the vast majority of the time, even if this simply entails pointing them to the relevant form, document or CO. This requires an up-to-date knowledge of how the 101st functions. As such, you should keep a constant eye on the announcement and promotion channels for changes to procedures or the chain of command.\nSergeant\nSergeants are squad ICs, meaning they are the direct leader of everyone in their squad. As a Sergeant, it will be your duty to ensure the activity and dedication of your squad by organizing Deployments regularly at a time tailored for its members. Whether these are open to members from other squads is up to you. As a rule of thumb, every squad should have one Deployment scheduled specifically for it. You will also be in charge of moderating your squad&#039;s text channel, ensuring that all messages and images adhere to the 101st rules. Like a corporal, you must be able to respond to the questions, complaints or requests of your squad members, or direct them to the relevant resources or up the chain of command if you can&#039;t give an answer yourself. \nSergeant Mayor\nSergeant Majors are platoon 2ICs, as well as Squad ICs, meaning they have all of the duties of a Sergeant mentioned throughout this cadre, as well as a separate set of duties specific to them. As a Sergeant Major, you should build a strong understanding of the squads, Sergeants and Corporals in your platoon, in order to liaise with them and help them to communicate with each other and with the platoon&#039;s Lieutenant. Your duties will include issuing specific tasks and targets to the Sergeants in your platoon based upon your Lieutenant&#039;s goals and them helping those Sergeants to achieve them. You must also encourage the activity of the Sergeants and Corporals in your platoon and report any inactive or incompetent COs to your Lieutenant. Finally, you must ensure that squads which are active and full or near-full have a strong Corporal to support the Sergeant in leading the squad. This is discussed more in the Standard Operating Procedures section of the cadre\n"},"Resources/rules":{"title":"rules","links":[],"tags":[],"content":"Misc Rules\n\nRules about pinging people\n\n\n                  \n                  BG-01 &quot;Mind&quot; \n                  \n                \n\nNever ping something above you, like platoon company etc etc\nIf ur SL\nYou can ping platoon and below\nOnly ur platoon\nIf ur SM ur 2nd IC of a platoon\nYou can ping it but only yours\nSame goes with the rest\nI dont wanna se CPLs doing platoon wide pings\nAnd SLs doing company wide pings\n\n\n\nServer Rules\n\n\nUphold and salute your Commanding Officers with unwavering respect and obedience, for they are the mighty beacons guiding our glorious crusade. Follow the chain of command diligently, as a true patriot would.\n\n\nStay as active as a hypercharged Patriot Armor! If you’re to embark on a covert mission away from the battlefield for an extended period, report your absence promptly. Remember, inactivity is akin to surrendering to the enemy and will result in assignment to the dreaded @deserter sector.\n\n\nLet freedom reign, but keep it PG-13! No hint of nudity, lewdness, or anything that might make Uncle Sam blush. Do not record anyone without their consent. We’re all about spreading democracy, not indecency. And remember, even your profile picture should be as pure as the stars and stripes.\n\n\nNo spamming like a malfunctioning Democracy Distributor! Use communication channels wisely and refrain from public disputes. If you’ve got a bone to pick, take it to the DMs, soldier.\n\n\nOur battlefield is a bastion of respect and camaraderie, not a breeding ground for toxicity or hate speech. Any behavior unbecoming of a true patriot, from targeted harassment to spreading dissent, will be met with the full force of justice.\n\n\nImpersonation is the highest form of treason! Don’t even think about masquerading as another patriot, whether through words or profile pictures. Individuality is our greatest strength.\n\n\nNo hawking or haggling on our hallowed grounds! This is not a marketplace; it’s a sanctuary for liberty. Cheating, hacking, or any other underhanded tactics will be met with swift justice.\n\n\nMutiny and dissent are the enemies of democracy! Any talk of revolt or undermining our Commanding Officers will be met with the most severe penalties, from demotion to expulsion from our ranks.\n\n\nTime is precious, like the last charge of a Liberty Launcher. Don’t waste the valuable time of our staff with frivolous inquiries. Consult our documents and basic-info before raising a flag of concern.\n\n\nLoyalty is our currency! Patriots of the 101st shall not double-dip in other milsims or clans. Our allegiance lies solely with the cause of spreading democracy. Starsims and other games are exempt, for freedom knows no bounds.\n\n\nPoaching is akin to betraying the very essence of democracy! Any attempt to lure away our fellow patriots will result in swift and decisive action, including expulsion from our ranks.\nAlt accounts are as welcome as a communist in a fireworks factory! One patriot, one account. Let your actions be as transparent as the ideals we uphold.\nNever ping something above you, like platoon company etc etc\nf ur SL\nYou can ping platoon and below\nOnly ur platoon\nIf ur SM ur 2nd IC of a platoon\nYou can ping it but only yours\nSame goes with the rest\nI dont wanna se CPLs doing platoon wide pings\nAnd SLs doing company wide pings"},"Resources/sanction-system":{"title":"sanction-system","links":[],"tags":[],"content":"\nIn the spirit of maintaining discipline and order, violations of our sacred code will not go unpunished. Our Commanding Officers (COs) shall mete out justice with a firm yet fair hand, employing a system of warning points commensurate with the transgression. Behold the consequences:\n\n5 points: A 24-hour silence befalls you, akin to a temporary radio blackout.\n10 points: A 48-hour silence echoes through the ranks, a stern reminder of the gravity of your actions.\n15 points: A 120-hour silence ensues, casting you into the shadows of reflection, and you shall find your name etched upon the promotion blacklist.\n20 points: A double-edged blade of punishment strikes: a 120-hour silence, followed by a suspension spanning two days, and your name shall dwell upon the blacklist, a mark of shame.\n25 points: The ultimate sanction descends upon thee – banishment from our ranks, forever exiled from the halls of liberty.\n\nAfter 15 Points\nUpon accumulating 15 points, patriots find themselves consigned to the promotion blacklist. To redeem oneself, a rigorous path to redemption must be trodden:\n\nSpend 30 days in the fold of our community, proving your unwavering commitment.\nAttend 10 deployments, demonstrating your dedication to the cause.\nGarner consideration for promotion, subject to verification by a CO in consultation with High Command.\nSubmit to a tribunal presided over by the esteemed BC-01 “Mind”, wherein your actions shall be weighed against the scales of justice, and redemption may be earned.\n\nFor High Command and Senior Command\nSenctions in High/Senior Command don’t follow the normal point System.\nFor Senior Command\n\n3 Strikes and you are relived of your Senior Command duties\n1 Strike gets removed every 3 months\nfor High Command\n3 Strikes and you are relived of your High Command duties\n1 Strike gets removed every month\n"},"Resources/useful-tools":{"title":"Useful Tools","links":[],"tags":["tools","ressources"],"content":"\nIndex\n\nColor your Discord messages\nDate Picker\nHelldiver Training Manual\nHelldivers Companion\n\nColor your Discord messages\n\n\n\n\n\n\n\n\n\n\n\nrebane2001.com/discord-colored-text-generator/\n\nDiscord Date Picker\n\n\n\n\n\n\n\n\n\n\n\ndiscord-date.shyked.fr/\n\nHelldiver Training Manual\n\n\n\n\n\n\n\n\n\n\n\nhelldiverstrainingmanual.com/\n\nHelldivers Companion\n\n\n\n\n\n\n\n\n\n\n\nhelldiverscompanion.com/#\n"},"The-Compendium/How-To-Helldive/hth-1-loadout-types":{"title":"1 Loadouts Types","links":[],"tags":["HTH","Compendium"],"content":"\nHello Divers! This is Loadouts explained. This document will show you what types of weapons there are and in Part 2 will show you how to make a proper loadout. As you may know, weapons can fit into different types at the same time.\nTypes: There are several types of weapons a Diver would bring for a loudout.\n\nGeneralist [GL]\nSingle-Target [ST]\nMobbing [MB]\nCrowd-Control [CC]\n\nGeneralist\nGL weapons are able to fill out each role to some extent. Good Single Target and Mobbing DMG or DPS, paired with some Stagger and Push. Examples would be the SG-225IE Breaker Incendiary and the SG-8P Punisher Plasma, Terminid and Automaton GL type weapon respectively. Each has CC capabilites, Incendiary and high Stagger, alongside mobbing groups of enemies and smashing single targets. Having these types of weapons can make a mission a lot better, as they fill out plenty of roles.\nSingle-Target\nST weapons are able to kill a singular enemy at a time. To make up for the lack of mobbing, these weapons are paired with high Stagger or Push and have a fast TTK. Examples would be the JAR-5 Dominator or the SG-8 Punisher, both have amazing ST DMG and good CC capabilities. These weapons can help aid a team when there isn’t enough fast ways to kill enemies.\nMobbing\nMB weapons as stated in the name, are able to kill several or a dozen enemies faster than a Single-Target enemy could. These weapons usually have something aiding them to kill, Incendiary, high DPS, etc. Examples could be AR-23A Liberator Carbine, with its high DPS and fast RPM, it can take out several bugs in a couple of seconds. These weapons will aid in a team when there are too many enemies to take out, so bring one with you.\nCrowd-Control\nCC weapons are found with different categories, these weapon are able to Stagger, Push, and Flinch enemies EFFECTIVELY, unlike the Slugger… Weapons with strong CC capabilties would be the SG-8 Punisher, able to push enemies back effectively.\n\nCredit\nWritten by Head of Compendium SGT Styanax\n\n"},"The-Compendium/How-To-Helldive/hth-2-loadout-creation":{"title":"2 Loadout Creation","links":["The-Compendium/How-To-Helldive/hth-1-loadout-types"],"tags":["Compendium","HTH"],"content":"\nDISCLAIMER: PLEASE READ\nhth-1-loadout-types\nBEFORE READING THIS DOCUMENT\nHello Divers! This is Loadouts, explained. This document will show you how you can use the several types of weaponry within our arsenal to make a Jack-of-all-Trades loadout or a specialised one!\nLoadout Creation - Basics\nDepending on which enemies you’re facing, each type of weapon may be prioritised over others. When making a Generalist loadout, you may want to use Generalist stratagems and weapons, the PLAS-1 Scorcher and the AC-8 Autocannon can be paired as generalists. If you want to run a weapon that is Single-Target, you may want to bring a weapon that leans more to the mobbing side, vice versa. When fighting bugs, Generalists like the SG-225IE and the ARC-12 are strong options as well as Mobbing weapons are decently strong. Single-Target weapons are not as need but can still be strong options. When fighting bots, Generalists like the SG-8P and PLAS-1 are strong options. However, unlike Terminids, Single-Target weapons are a decent margin better than Mobbing weapons. However, if you’d like a specialised build, spending your Primaries, Secondaries, Supports, and 1 or 2 Stratagems helping with that specific loadout type, will be a good option, however, spending all of your stratagems on 1 type may lead to holes within your loadout, causing you to be unable to kill specific enemies fast.\nHow to Pair Weapons\nMany weapons can have synergy, having weapons that match together because they fill out each other’s weaknesses is a good way to find how to pair a weapon. The SG-8 Punisher is good at Stagger and Single-Target killing but is unable to kill each enemy fast enough to fight a horde quickly, pairing it with a mobbing weapon like the GL-21 Grenade Launcher would be extremely helpful it, covering its mobbing weakness.\n\nCredit\nWritten by Head of Compendium SGT Styanax\n\n"},"The-Compendium/How-To-Helldive/hth-3-loadout-synergy":{"title":"3 Loadout Synergy","links":["The-Compendium/How-To-Helldive/hth-1-loadout-types","The-Compendium/How-To-Helldive/hth-2-loadout-creation"],"tags":["Compendium","HTH"],"content":"\nDISCLAIMER: PLEASE READ\nhth-1-loadout-types &amp; hth-2-loadout-creation\nBEFORE READING THIS DOCUMENT\nHello Divers! This is Loadouts, explained. This document will show you how a mediocre Stratagem can become an extremely good Stratagem when paired with the right Loadout! _\nBasic Synergy\nMany weapons usually fill out one role within the Loadout, with other Stratagems filling out the other roles that the weapon itself cannnot fill out. However, many Stratagems can be paired with other weapons to unlock more playstyles and help that specific weapon with its weakness.\nHow to Synergise a Loadout\nAll weapons have set Armour Penetration levels, being scaled on 0 - 10. Weapons such as the Grenade Launcher have an AP level of 3 / 10, giving it Type 1 Medium Armour Penetration, this means it cannot penetrate Bile Titan Armour at a level of 5 / 10 on the body, and 6 / 10 on the leg. This weapon is extremely good at mobbing but it unable to take out Heavy Targets. To make up for this downside a Diver could use a 500 KG, or make a synergy within the Loadout by using the Eagle 110 mm Rocket Pods. When used correctly the Eagle 110 can knock off the side Armour of the Bile Titan, which allows for the Grenade Launcher to shoot around the area, killing the Titan in around 2 - 4 Shots, however it can still be more depending on how the Rocket Pods land.\nYou need to consider all pros on cons of a specific Stratagem, and pair it up with another Stratagem that can help fill out a small gap within the area you need filling out, as well as filling out another area. An example would be the GL-21 Grenade Launcher given in the prior paragraph - The Grenade Launcher can damage Bile Titans but only the Bile Sack, however when using the Rocket Pods correctly, the Grenade Launcher can directly damage the Bile Titan. (edited)\n\nCredit\nWritten by Head of Compendium SGT Styanax\n\n"},"The-Compendium/compendium-index":{"title":"Compendium Index","links":[],"tags":["Compendium"],"content":"\nWelcome to the 101st Compendium\neverything here is still under construction and only the How to Helldive stuff is actually implemented\n"},"channel-overview":{"title":"Chanel Overview","links":["Resources/medals","Deployment-Signups"],"tags":[],"content":"\nCurrently OUT OF DATE\n\nServer Stats\n\nNot technically channels just there for looks\n\nOnbording Stuff\n\nEverything except for sanctions is a one time read and you don’t have to really pay attention to these\n\nThis is where sanctions for people that misbehave are posted if you get pinged here good luck\n\nThis channel is where server booster messages are posted\n\nH.E.A.T.\n\nUnder Construction\n\nTech Department\n\nThis is where technical things about the game like strategies and server tech stuff gets posted and discussed\n\nThe Battalion\n\nThe “galactic war status” channel contains an updating message that displays the current status of the war like mayor orders\nThis is what it looks like:\n\n\nWar updates is a record of the events that happend in-game like libarating a planet\n\n\nGame updates logs the announcements made in the official discord\n\n\n\nBattalion structure and resources are channels where you can learn about the battalion same as the wiki (hi :3)\nHistory and lore is where you can read up on the lore of the server we also have these here\n\n\nIn announcements important things that happen in the server are posted\n\n\nIn medals and promotion you get notified if you get a promotion or a medal\nto learn what you need to do to get a medal click here\n\n\nThese channels are pretty self explanatory but hub is your general chat while picks clips and memes are more “specialized”\n\n\nThis is where you can request a helmet if you are a Sargent or if you aren’t check the pinned messages to see the premade helmets\n\n\nLOA request is where you write a message to let the people in the server now if you are unavailable PLEASE ONLY MAKE A LOA REQUEST IF YOU WILL BE GONE FOR MORE THAN 5 DAYS\n\n\nThe suggestions channel is where you can make suggestions about the server and have them rejected by high command\nThe bot commands channel is where you use the bots on the server\n\nVoice Channels\n\nThis is where you can talk to your fellow helldivers and enjoy there company\nLFG channels are for playing casual matches that don’t award any points and also typically involve less roleplay\n\nDeployments\n\nLook here for an explanation Deployment Signups\n\nCompany Platoon and Squad chat\n\nThese channels will vary based on what Company/Platoon/Squad you are in but they follow the same basic layout.\nThe channel with your squad name (here deceptive-harlequins) is a channel where only the members of your own squad can see your messages\nThe platoon hub is only for members of your platoon and the company hub is for members of your company\nThe company order channel is for small announcements that concern mostly just your company\nThe company structure channel is used to display the company structure\n"},"index":{"title":"Welcome","links":["101-Training-Program/newbie-overview","Resources/deployment-course"],"tags":[],"content":"\n\nThis is the wiki of the 101st “Hell” Battalion the most active Helldivers 2 Millsim Server\n\n\n\nStart here: newbie-overview\n\n\nThis wiki serves as a overview for all of the different resources you can find in the discord the wiki is constantly being expanded with new resources, guides and more.\nWe are always looking for Interested Helldivers who want to help maintaining the wiki\n\nAt the current time the Wiki is not finished and might still contain some mistakes if you find anything that doesn’t look right please message one of the Current maintainers of the Wiki\n\nCurrent Maintainers of the Wiki:\n\nCosteer (Head of Wiki)\n\nThanks to the contributors of the Wiki\n\nStells\nStyanax (Head of the Compendium)\nGael (Oversees the Project)\nAin deployment-course\n\nAcknowledgements\n\nlayout heavily inspired by the Morrowind Modding wiki\ncredit for none s\n\n"}}